[Survived] BlockStatement
src/components/editors/AgentNodeEditor.tsx:30:19
   const [maxTokensValue, setMaxTokensValue] = useState<string | number>('')
 
   // Sync local state with node data
-  useEffect(() => {
-    const agentConfig = node.data.agent_config || {}
-    
-    if (document.activeElement !== systemPromptRef.current) {
-      setSystemPromptValue(agentConfig.system_prompt || '')
-    }
-    if (document.activeElement !== maxTokensRef.current) {
-      setMaxTokensValue(agentConfig.max_tokens || '')
-    }
-  }, [node.data.agent_config])
+  useEffect(() => {}, [node.data.agent_config])
 
   const agentConfig = node.data.agent_config || {}

[Survived] LogicalOperator
src/components/editors/AgentNodeEditor.tsx:31:25
 
   // Sync local state with node data
   useEffect(() => {
-    const agentConfig = node.data.agent_config || {}
+    const agentConfig = node.data.agent_config && {}
     
     if (document.activeElement !== systemPromptRef.current) {

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:31:25
 
   // Sync local state with node data
   useEffect(() => {
-    const agentConfig = node.data.agent_config || {}
+    const agentConfig = true
     
     if (document.activeElement !== systemPromptRef.current) {

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:33:9
   useEffect(() => {
     const agentConfig = node.data.agent_config || {}
     
-    if (document.activeElement !== systemPromptRef.current) {
+    if (true) {
       setSystemPromptValue(agentConfig.system_prompt || '')
     }

[Survived] EqualityOperator
src/components/editors/AgentNodeEditor.tsx:33:9
   useEffect(() => {
     const agentConfig = node.data.agent_config || {}
     
-    if (document.activeElement !== systemPromptRef.current) {
+    if (document.activeElement === systemPromptRef.current) {
       setSystemPromptValue(agentConfig.system_prompt || '')
     }

[Survived] LogicalOperator
src/components/editors/AgentNodeEditor.tsx:34:28
     const agentConfig = node.data.agent_config || {}
     
     if (document.activeElement !== systemPromptRef.current) {
-      setSystemPromptValue(agentConfig.system_prompt || '')
+      setSystemPromptValue(agentConfig.system_prompt && '')
     }
     if (document.activeElement !== maxTokensRef.current) {

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:34:28
     const agentConfig = node.data.agent_config || {}
     
     if (document.activeElement !== systemPromptRef.current) {
-      setSystemPromptValue(agentConfig.system_prompt || '')
+      setSystemPromptValue(true)
     }
     if (document.activeElement !== maxTokensRef.current) {

[Survived] BlockStatement
src/components/editors/AgentNodeEditor.tsx:36:58
     if (document.activeElement !== systemPromptRef.current) {
       setSystemPromptValue(agentConfig.system_prompt || '')
     }
-    if (document.activeElement !== maxTokensRef.current) {
-      setMaxTokensValue(agentConfig.max_tokens || '')
-    }
+    if (document.activeElement !== maxTokensRef.current) {}
   }, [node.data.agent_config])
 

[Survived] EqualityOperator
src/components/editors/AgentNodeEditor.tsx:36:9
     if (document.activeElement !== systemPromptRef.current) {
       setSystemPromptValue(agentConfig.system_prompt || '')
     }
-    if (document.activeElement !== maxTokensRef.current) {
+    if (document.activeElement === maxTokensRef.current) {
       setMaxTokensValue(agentConfig.max_tokens || '')
     }

[Survived] LogicalOperator
src/components/editors/AgentNodeEditor.tsx:37:25
       setSystemPromptValue(agentConfig.system_prompt || '')
     }
     if (document.activeElement !== maxTokensRef.current) {
-      setMaxTokensValue(agentConfig.max_tokens || '')
+      setMaxTokensValue(agentConfig.max_tokens && '')
     }
   }, [node.data.agent_config])

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:37:25
       setSystemPromptValue(agentConfig.system_prompt || '')
     }
     if (document.activeElement !== maxTokensRef.current) {
-      setMaxTokensValue(agentConfig.max_tokens || '')
+      setMaxTokensValue(false)
     }
   }, [node.data.agent_config])

[Survived] ArrayDeclaration
src/components/editors/AgentNodeEditor.tsx:39:6
     if (document.activeElement !== maxTokensRef.current) {
       setMaxTokensValue(agentConfig.max_tokens || '')
     }
-  }, [node.data.agent_config])
+  }, [])
 
   const agentConfig = node.data.agent_config || {}

[Survived] LogicalOperator
src/components/editors/AgentNodeEditor.tsx:41:23
     }
   }, [node.data.agent_config])
 
-  const agentConfig = node.data.agent_config || {}
+  const agentConfig = node.data.agent_config && {}
   const currentModel = agentConfig.model || (availableModels.length > 0 ? availableModels[0].value : 'gpt-4o-mini')
 

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:41:23
     }
   }, [node.data.agent_config])
 
-  const agentConfig = node.data.agent_config || {}
+  const agentConfig = true
   const currentModel = agentConfig.model || (availableModels.length > 0 ? availableModels[0].value : 'gpt-4o-mini')
 

[NoCoverage] EqualityOperator
src/components/editors/AgentNodeEditor.tsx:42:46
   }, [node.data.agent_config])
 
   const agentConfig = node.data.agent_config || {}
-  const currentModel = agentConfig.model || (availableModels.length > 0 ? availableModels[0].value : 'gpt-4o-mini')
+  const currentModel = agentConfig.model || (availableModels.length <= 0 ? availableModels[0].value : 'gpt-4o-mini')
 
   return (

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:42:24
   }, [node.data.agent_config])
 
   const agentConfig = node.data.agent_config || {}
-  const currentModel = agentConfig.model || (availableModels.length > 0 ? availableModels[0].value : 'gpt-4o-mini')
+  const currentModel = false
 
   return (

[Killed] ArrowFunction
src/components/editors/AgentNodeEditor.tsx:59:21
         <select
           id="agent-model"
           value={currentModel}
-          onChange={(e) =>
-            onUpdate('agent_config', {
-              ...agentConfig,
-              model: e.target.value,
-            })
+          onChange={() => undefined
           }
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
killedBy: AgentNodeEditor should call onUpdate when model changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent_config', ObjectContaining{…} ]

Number of calls: 0

[Killed] StringLiteral
src/components/editors/AgentNodeEditor.tsx:60:22
           id="agent-model"
           value={currentModel}
           onChange={(e) =>
-            onUpdate('agent_config', {
+            onUpdate("", {
               ...agentConfig,
               model: e.target.value,
killedBy: AgentNodeEditor should call onUpdate when model changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent_config', ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   "agent_config",

[Killed] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:68:12
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
           aria-label="Select LLM model for agent"
         >
-          {availableModels.length > 0 ? (
+          {true ? (
             availableModels.map((model) => (
               <option key={model.value} value={model.value}>
killedBy: AgentNodeEditor should display default models when availableModels is empty
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] EqualityOperator
src/components/editors/AgentNodeEditor.tsx:68:12
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
           aria-label="Select LLM model for agent"
         >
-          {availableModels.length > 0 ? (
+          {availableModels.length >= 0 ? (
             availableModels.map((model) => (
               <option key={model.value} value={model.value}>
killedBy: AgentNodeEditor should display default models when availableModels is empty
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ArrowFunction
src/components/editors/AgentNodeEditor.tsx:69:33
           aria-label="Select LLM model for agent"
         >
           {availableModels.length > 0 ? (
-            availableModels.map((model) => (
-              <option key={model.value} value={model.value}>
-                {model.label}
-              </option>
-            ))
+            availableModels.map(() => undefined)
           ) : (
             <>
killedBy: AgentNodeEditor should display current model value
statusReason: expected '' to be 'gpt-4' // Object.is equality

[Survived] EqualityOperator
src/components/editors/AgentNodeEditor.tsx:84:12
           )}
         </select>
         <p className="text-xs text-gray-500 mt-1">
-          {availableModels.length > 0 
+          {availableModels.length <= 0 
             ? `This agent will use the configured LLM provider with the selected model`
             : 'This agent will call the OpenAI API with this model. Configure providers in Settings.'}

[Survived] EqualityOperator
src/components/editors/AgentNodeEditor.tsx:84:12
           )}
         </select>
         <p className="text-xs text-gray-500 mt-1">
-          {availableModels.length > 0 
+          {availableModels.length >= 0 
             ? `This agent will use the configured LLM provider with the selected model`
             : 'This agent will call the OpenAI API with this model. Configure providers in Settings.'}

[Survived] StringLiteral
src/components/editors/AgentNodeEditor.tsx:85:15
         </select>
         <p className="text-xs text-gray-500 mt-1">
           {availableModels.length > 0 
-            ? `This agent will use the configured LLM provider with the selected model`
+            ? ``
             : 'This agent will call the OpenAI API with this model. Configure providers in Settings.'}
         </p>

[Killed] BlockStatement
src/components/editors/AgentNodeEditor.tsx:102:28
           id="agent-system-prompt"
           ref={systemPromptRef}
           value={systemPromptValue}
-          onChange={(e) => {
-            const newValue = e.target.value
-            setSystemPromptValue(newValue)
-            onConfigUpdate('agent_config', 'system_prompt', newValue)
-          }}
+          onChange={(e) => {}}
           rows={4}
           placeholder="You are a helpful assistant that..."
killedBy: AgentNodeEditor should call onConfigUpdate when system prompt changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent_config', …(2) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/components/editors/AgentNodeEditor.tsx:105:44
           onChange={(e) => {
             const newValue = e.target.value
             setSystemPromptValue(newValue)
-            onConfigUpdate('agent_config', 'system_prompt', newValue)
+            onConfigUpdate('agent_config', "", newValue)
           }}
           rows={4}
killedBy: AgentNodeEditor should call onConfigUpdate when system prompt changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent_config', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "agent_config",

[Killed] StringLiteral
src/components/editors/AgentNodeEditor.tsx:105:28
           onChange={(e) => {
             const newValue = e.target.value
             setSystemPromptValue(newValue)
-            onConfigUpdate('agent_config', 'system_prompt', newValue)
+            onConfigUpdate("", 'system_prompt', newValue)
           }}
           rows={4}
killedBy: AgentNodeEditor should call onConfigUpdate when system prompt changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent_config', …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "agent_config",

[Survived] OptionalChaining
src/components/editors/AgentNodeEditor.tsx:124:25
           htmlFor="agent-temperature"
           className="block text-sm font-medium text-gray-700 mb-1"
         >
-          Temperature: {agentConfig.temperature?.toFixed(1) || '0.7'}
+          Temperature: {agentConfig.temperature.toFixed(1) || '0.7'}
         </label>
         <input

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:124:25
           htmlFor="agent-temperature"
           className="block text-sm font-medium text-gray-700 mb-1"
         >
-          Temperature: {agentConfig.temperature?.toFixed(1) || '0.7'}
+          Temperature: {false}
         </label>
         <input

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:132:18
           min="0"
           max="1"
           step="0.1"
-          value={agentConfig.temperature || 0.7}
+          value={true}
           onChange={(e) =>
             onUpdate('agent_config', {

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:132:18
           min="0"
           max="1"
           step="0.1"
-          value={agentConfig.temperature || 0.7}
+          value={false}
           onChange={(e) =>
             onUpdate('agent_config', {

[Killed] ArrowFunction
src/components/editors/AgentNodeEditor.tsx:133:21
           max="1"
           step="0.1"
           value={agentConfig.temperature || 0.7}
-          onChange={(e) =>
-            onUpdate('agent_config', {
-              ...agentConfig,
-              temperature: parseFloat(e.target.value),
-            })
+          onChange={() => undefined
           }
           className="w-full"
killedBy: AgentNodeEditor should call onUpdate when temperature changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent_config', ObjectContaining{…} ]

Number of calls: 0

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:143:26
           aria-label="Temperature control for agent creativity"
           aria-valuemin={0}
           aria-valuemax={1}
-          aria-valuenow={agentConfig.temperature || 0.7}
+          aria-valuenow={true}
         />
         <div className="flex justify-between text-xs text-gray-500 mt-1">

[Survived] ConditionalExpression
src/components/editors/AgentNodeEditor.tsx:143:26
           aria-label="Temperature control for agent creativity"
           aria-valuemin={0}
           aria-valuemax={1}
-          aria-valuenow={agentConfig.temperature || 0.7}
+          aria-valuenow={false}
         />
         <div className="flex justify-between text-xs text-gray-500 mt-1">

[Killed] BlockStatement
src/components/editors/AgentNodeEditor.tsx:164:28
           ref={maxTokensRef}
           type="number"
           value={maxTokensValue}
-          onChange={(e) => {
-            const newValue = e.target.value ? parseInt(e.target.value) : undefined
-            setMaxTokensValue(e.target.value)
-            onConfigUpdate('agent_config', 'max_tokens', newValue)
-          }}
+          onChange={(e) => {}}
           placeholder="Leave blank for default"
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
killedBy: AgentNodeEditor should call onConfigUpdate when max tokens changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent_config', 'max_tokens', 2000 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/components/editors/AgentNodeEditor.tsx:167:44
           onChange={(e) => {
             const newValue = e.target.value ? parseInt(e.target.value) : undefined
             setMaxTokensValue(e.target.value)
-            onConfigUpdate('agent_config', 'max_tokens', newValue)
+            onConfigUpdate('agent_config', "", newValue)
           }}
           placeholder="Leave blank for default"
killedBy: AgentNodeEditor should call onConfigUpdate when max tokens changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'agent_config', 'max_tokens', 2000 ]

Received: 

  1st vi.fn() call:

  [
    "agent_config",
