[Survived] StringLiteral
src/components/editors/ConditionNodeEditor.tsx:22:66
   const conditionFieldRef = useRef<HTMLInputElement>(null)
   const conditionValueRef = useRef<HTMLInputElement>(null)
   
-  const [conditionFieldValue, setConditionFieldValue] = useState('')
+  const [conditionFieldValue, setConditionFieldValue] = useState("Stryker was here!")
   const [conditionValueValue, setConditionValueValue] = useState('')
 

[Survived] BlockStatement
src/components/editors/ConditionNodeEditor.tsx:26:19
   const [conditionValueValue, setConditionValueValue] = useState('')
 
   // Sync local state with node data
-  useEffect(() => {
-    const conditionConfig = node.data.condition_config || {}
-    
-    if (document.activeElement !== conditionFieldRef.current) {
-      setConditionFieldValue(conditionConfig.field || '')
-    }
-    if (document.activeElement !== conditionValueRef.current) {
-      setConditionValueValue(conditionConfig.value || '')
-    }
-  }, [node.data.condition_config])
+  useEffect(() => {}, [node.data.condition_config])
 
   const conditionConfig = node.data.condition_config || {}

[Survived] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:27:29
 
   // Sync local state with node data
   useEffect(() => {
-    const conditionConfig = node.data.condition_config || {}
+    const conditionConfig = false
     
     if (document.activeElement !== conditionFieldRef.current) {

[Survived] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:27:29
 
   // Sync local state with node data
   useEffect(() => {
-    const conditionConfig = node.data.condition_config || {}
+    const conditionConfig = true
     
     if (document.activeElement !== conditionFieldRef.current) {

[Survived] BlockStatement
src/components/editors/ConditionNodeEditor.tsx:29:63
   useEffect(() => {
     const conditionConfig = node.data.condition_config || {}
     
-    if (document.activeElement !== conditionFieldRef.current) {
-      setConditionFieldValue(conditionConfig.field || '')
-    }
+    if (document.activeElement !== conditionFieldRef.current) {}
     if (document.activeElement !== conditionValueRef.current) {
       setConditionValueValue(conditionConfig.value || '')

[Survived] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:29:9
   useEffect(() => {
     const conditionConfig = node.data.condition_config || {}
     
-    if (document.activeElement !== conditionFieldRef.current) {
+    if (false) {
       setConditionFieldValue(conditionConfig.field || '')
     }

[Survived] LogicalOperator
src/components/editors/ConditionNodeEditor.tsx:30:30
     const conditionConfig = node.data.condition_config || {}
     
     if (document.activeElement !== conditionFieldRef.current) {
-      setConditionFieldValue(conditionConfig.field || '')
+      setConditionFieldValue(conditionConfig.field && '')
     }
     if (document.activeElement !== conditionValueRef.current) {

[Survived] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:30:30
     const conditionConfig = node.data.condition_config || {}
     
     if (document.activeElement !== conditionFieldRef.current) {
-      setConditionFieldValue(conditionConfig.field || '')
+      setConditionFieldValue(true)
     }
     if (document.activeElement !== conditionValueRef.current) {

[Survived] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:32:9
     if (document.activeElement !== conditionFieldRef.current) {
       setConditionFieldValue(conditionConfig.field || '')
     }
-    if (document.activeElement !== conditionValueRef.current) {
+    if (true) {
       setConditionValueValue(conditionConfig.value || '')
     }

[Survived] EqualityOperator
src/components/editors/ConditionNodeEditor.tsx:32:9
     if (document.activeElement !== conditionFieldRef.current) {
       setConditionFieldValue(conditionConfig.field || '')
     }
-    if (document.activeElement !== conditionValueRef.current) {
+    if (document.activeElement === conditionValueRef.current) {
       setConditionValueValue(conditionConfig.value || '')
     }

[Survived] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:33:30
       setConditionFieldValue(conditionConfig.field || '')
     }
     if (document.activeElement !== conditionValueRef.current) {
-      setConditionValueValue(conditionConfig.value || '')
+      setConditionValueValue(false)
     }
   }, [node.data.condition_config])

[Survived] LogicalOperator
src/components/editors/ConditionNodeEditor.tsx:33:30
       setConditionFieldValue(conditionConfig.field || '')
     }
     if (document.activeElement !== conditionValueRef.current) {
-      setConditionValueValue(conditionConfig.value || '')
+      setConditionValueValue(conditionConfig.value && '')
     }
   }, [node.data.condition_config])

[Killed] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:37:27
     }
   }, [node.data.condition_config])
 
-  const conditionConfig = node.data.condition_config || {}
+  const conditionConfig = false
   const conditionType = conditionConfig.condition_type || 'equals'
   const showValueField = conditionType !== 'empty' && conditionType !== 'not_empty'
killedBy: ConditionNodeEditor should hide value field for empty/not_empty conditions
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  aria-label="Value to compare against field"
  class="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
  id="condition-value"
  placeholder="Value to compare"
  type="text"

[Killed] LogicalOperator
src/components/editors/ConditionNodeEditor.tsx:37:27
     }
   }, [node.data.condition_config])
 
-  const conditionConfig = node.data.condition_config || {}
+  const conditionConfig = node.data.condition_config && {}
   const conditionType = conditionConfig.condition_type || 'equals'
   const showValueField = conditionType !== 'empty' && conditionType !== 'not_empty'
killedBy: ConditionNodeEditor should hide value field for empty/not_empty conditions
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  aria-label="Value to compare against field"
  class="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
  id="condition-value"
  placeholder="Value to compare"
  type="text"

[Killed] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:38:25
   }, [node.data.condition_config])
 
   const conditionConfig = node.data.condition_config || {}
-  const conditionType = conditionConfig.condition_type || 'equals'
+  const conditionType = true
   const showValueField = conditionType !== 'empty' && conditionType !== 'not_empty'
 
killedBy: ConditionNodeEditor should hide value field for empty/not_empty conditions
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  aria-label="Value to compare against field"
  class="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
  id="condition-value"
  placeholder="Value to compare"
  type="text"

[Killed] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:38:25
   }, [node.data.condition_config])
 
   const conditionConfig = node.data.condition_config || {}
-  const conditionType = conditionConfig.condition_type || 'equals'
+  const conditionType = false
   const showValueField = conditionType !== 'empty' && conditionType !== 'not_empty'
 
killedBy: ConditionNodeEditor should hide value field for empty/not_empty conditions
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  aria-label="Value to compare against field"
  class="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
  id="condition-value"
  placeholder="Value to compare"
  type="text"

[Killed] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:39:26
 
   const conditionConfig = node.data.condition_config || {}
   const conditionType = conditionConfig.condition_type || 'equals'
-  const showValueField = conditionType !== 'empty' && conditionType !== 'not_empty'
+  const showValueField = true
 
   return (
killedBy: ConditionNodeEditor should hide value field for empty/not_empty conditions
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  aria-label="Value to compare against field"
  class="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
  id="condition-value"
  placeholder="Value to compare"
  type="text"

[Killed] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:39:26
 
   const conditionConfig = node.data.condition_config || {}
   const conditionType = conditionConfig.condition_type || 'equals'
-  const showValueField = conditionType !== 'empty' && conditionType !== 'not_empty'
+  const showValueField = true && conditionType !== 'not_empty'
 
   return (
killedBy: ConditionNodeEditor should hide value field for empty/not_empty conditions
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  aria-label="Value to compare against field"
  class="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
  id="condition-value"
  placeholder="Value to compare"
  type="text"

[Killed] ArrowFunction
src/components/editors/ConditionNodeEditor.tsx:54:21
         <select
           id="condition-type"
           value={conditionType}
-          onChange={(e) =>
-            onConfigUpdate('condition_config', 'condition_type', e.target.value)
+          onChange={() => undefined
           }
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
killedBy: ConditionNodeEditor should call onConfigUpdate when condition type changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'condition_config', …(2) ]

Number of calls: 0

[Killed] StringLiteral
src/components/editors/ConditionNodeEditor.tsx:55:48
           id="condition-type"
           value={conditionType}
           onChange={(e) =>
-            onConfigUpdate('condition_config', 'condition_type', e.target.value)
+            onConfigUpdate('condition_config', "", e.target.value)
           }
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
killedBy: ConditionNodeEditor should call onConfigUpdate when condition type changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'condition_config', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "condition_config",

[Killed] BlockStatement
src/components/editors/ConditionNodeEditor.tsx:87:28
           ref={conditionFieldRef}
           type="text"
           value={conditionFieldValue}
-          onChange={(e) => {
-            const newValue = e.target.value
-            setConditionFieldValue(newValue)
-            onConfigUpdate('condition_config', 'field', newValue)
-          }}
+          onChange={(e) => {}}
           placeholder="Field to check"
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
killedBy: ConditionNodeEditor should call onConfigUpdate when field changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'condition_config', 'field', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:99:8
       </div>
 
       {/* Value (conditional) */}
-      {showValueField && (
-        <div className="mt-4">
-          <label 
-            htmlFor="condition-value"
-            className="block text-sm font-medium text-gray-700 mb-1"
-          >
-            Value
-          </label>
-          <input
-            id="condition-value"
-            ref={conditionValueRef}
-            type="text"
-            value={conditionValueValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setConditionValueValue(newValue)
-              onConfigUpdate('condition_config', 'value', newValue)
-            }}
-            placeholder="Value to compare"
-            className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
-            aria-label="Value to compare against field"
-          />
-        </div>
-      )}
+      {false}
     </>
   )
killedBy: ConditionNodeEditor should render condition configuration fields
statusReason: Unable to find a label with the text of: /^value$/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="block text-sm font-medium text-gray-700 mb-1"

[Killed] ConditionalExpression
src/components/editors/ConditionNodeEditor.tsx:99:8
       </div>
 
       {/* Value (conditional) */}
-      {showValueField && (
-        <div className="mt-4">
-          <label 
-            htmlFor="condition-value"
-            className="block text-sm font-medium text-gray-700 mb-1"
-          >
-            Value
-          </label>
-          <input
-            id="condition-value"
-            ref={conditionValueRef}
-            type="text"
-            value={conditionValueValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setConditionValueValue(newValue)
-              onConfigUpdate('condition_config', 'value', newValue)
-            }}
-            placeholder="Value to compare"
-            className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
-            aria-label="Value to compare against field"
-          />
-        </div>
-      )}
+      {true}
     </>
   )
killedBy: ConditionNodeEditor should render condition configuration fields
statusReason: Unable to find a label with the text of: /^value$/i

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="block text-sm font-medium text-gray-700 mb-1"

[Killed] BlockStatement
src/components/editors/ConditionNodeEditor.tsx:112:30
             ref={conditionValueRef}
             type="text"
             value={conditionValueValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setConditionValueValue(newValue)
-              onConfigUpdate('condition_config', 'value', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="Value to compare"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
killedBy: ConditionNodeEditor should call onConfigUpdate when value changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'condition_config', 'value', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/components/editors/ConditionNodeEditor.tsx:115:50
             onChange={(e) => {
               const newValue = e.target.value
               setConditionValueValue(newValue)
-              onConfigUpdate('condition_config', 'value', newValue)
+              onConfigUpdate('condition_config', "", newValue)
             }}
             placeholder="Value to compare"
killedBy: ConditionNodeEditor should call onConfigUpdate when value changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'condition_config', 'value', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "condition_config",

[Killed] StringLiteral
src/components/editors/ConditionNodeEditor.tsx:115:30
             onChange={(e) => {
               const newValue = e.target.value
               setConditionValueValue(newValue)
-              onConfigUpdate('condition_config', 'value', newValue)
+              onConfigUpdate("", 'value', newValue)
             }}
             placeholder="Value to compare"
killedBy: ConditionNodeEditor should call onConfigUpdate when value changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'condition_config', 'value', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "condition_config",
