[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:19:23
   node,
   onConfigUpdate
 }: InputNodeEditorProps) {
-  const inputConfig = node.data.input_config || {}
+  const inputConfig = false
   
   // GCP Bucket & AWS S3 shared refs

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:19:23
   node,
   onConfigUpdate
 }: InputNodeEditorProps) {
-  const inputConfig = node.data.input_config || {}
+  const inputConfig = true
   
   // GCP Bucket & AWS S3 shared refs

[NoCoverage] BooleanLiteral
src/components/editors/InputNodeEditor.tsx:53:56
   const [filePathValue, setFilePathValue] = useState('')
   const [filePatternValue, setFilePatternValue] = useState('')
   const [modeValue, setModeValue] = useState('read')
-  const [overwriteValue, setOverwriteValue] = useState(true)
+  const [overwriteValue, setOverwriteValue] = useState(false)
 
   // Sync local state with node data

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:57:9
 
   // Sync local state with node data
   useEffect(() => {
-    if (document.activeElement !== bucketNameRef.current) {
+    if (false) {
       setBucketNameValue(inputConfig.bucket_name || '')
     }

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:57:9
 
   // Sync local state with node data
   useEffect(() => {
-    if (document.activeElement !== bucketNameRef.current) {
+    if (true) {
       setBucketNameValue(inputConfig.bucket_name || '')
     }

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:58:26
   // Sync local state with node data
   useEffect(() => {
     if (document.activeElement !== bucketNameRef.current) {
-      setBucketNameValue(inputConfig.bucket_name || '')
+      setBucketNameValue(inputConfig.bucket_name && '')
     }
     if (document.activeElement !== objectPathRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:58:26
   // Sync local state with node data
   useEffect(() => {
     if (document.activeElement !== bucketNameRef.current) {
-      setBucketNameValue(inputConfig.bucket_name || '')
+      setBucketNameValue(false)
     }
     if (document.activeElement !== objectPathRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:60:9
     if (document.activeElement !== bucketNameRef.current) {
       setBucketNameValue(inputConfig.bucket_name || '')
     }
-    if (document.activeElement !== objectPathRef.current) {
+    if (true) {
       setObjectPathValue(inputConfig.object_path || '')
     }

[NoCoverage] EqualityOperator
src/components/editors/InputNodeEditor.tsx:60:9
     if (document.activeElement !== bucketNameRef.current) {
       setBucketNameValue(inputConfig.bucket_name || '')
     }
-    if (document.activeElement !== objectPathRef.current) {
+    if (document.activeElement === objectPathRef.current) {
       setObjectPathValue(inputConfig.object_path || '')
     }

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:61:26
       setBucketNameValue(inputConfig.bucket_name || '')
     }
     if (document.activeElement !== objectPathRef.current) {
-      setObjectPathValue(inputConfig.object_path || '')
+      setObjectPathValue(true)
     }
     if (document.activeElement !== gcpCredentialsRef.current) {

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:61:26
       setBucketNameValue(inputConfig.bucket_name || '')
     }
     if (document.activeElement !== objectPathRef.current) {
-      setObjectPathValue(inputConfig.object_path || '')
+      setObjectPathValue(inputConfig.object_path && '')
     }
     if (document.activeElement !== gcpCredentialsRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:63:9
     if (document.activeElement !== objectPathRef.current) {
       setObjectPathValue(inputConfig.object_path || '')
     }
-    if (document.activeElement !== gcpCredentialsRef.current) {
+    if (false) {
       setGcpCredentialsValue(inputConfig.credentials || '')
     }

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:63:9
     if (document.activeElement !== objectPathRef.current) {
       setObjectPathValue(inputConfig.object_path || '')
     }
-    if (document.activeElement !== gcpCredentialsRef.current) {
+    if (true) {
       setGcpCredentialsValue(inputConfig.credentials || '')
     }

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:64:30
       setObjectPathValue(inputConfig.object_path || '')
     }
     if (document.activeElement !== gcpCredentialsRef.current) {
-      setGcpCredentialsValue(inputConfig.credentials || '')
+      setGcpCredentialsValue(true)
     }
     if (document.activeElement !== objectKeyRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:64:30
       setObjectPathValue(inputConfig.object_path || '')
     }
     if (document.activeElement !== gcpCredentialsRef.current) {
-      setGcpCredentialsValue(inputConfig.credentials || '')
+      setGcpCredentialsValue(false)
     }
     if (document.activeElement !== objectKeyRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:66:9
     if (document.activeElement !== gcpCredentialsRef.current) {
       setGcpCredentialsValue(inputConfig.credentials || '')
     }
-    if (document.activeElement !== objectKeyRef.current) {
+    if (true) {
       setObjectKeyValue(inputConfig.object_key || '')
     }

[NoCoverage] EqualityOperator
src/components/editors/InputNodeEditor.tsx:66:9
     if (document.activeElement !== gcpCredentialsRef.current) {
       setGcpCredentialsValue(inputConfig.credentials || '')
     }
-    if (document.activeElement !== objectKeyRef.current) {
+    if (document.activeElement === objectKeyRef.current) {
       setObjectKeyValue(inputConfig.object_key || '')
     }

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:67:25
       setGcpCredentialsValue(inputConfig.credentials || '')
     }
     if (document.activeElement !== objectKeyRef.current) {
-      setObjectKeyValue(inputConfig.object_key || '')
+      setObjectKeyValue(true)
     }
     if (document.activeElement !== accessKeyIdRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:67:25
       setGcpCredentialsValue(inputConfig.credentials || '')
     }
     if (document.activeElement !== objectKeyRef.current) {
-      setObjectKeyValue(inputConfig.object_key || '')
+      setObjectKeyValue(false)
     }
     if (document.activeElement !== accessKeyIdRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:69:9
     if (document.activeElement !== objectKeyRef.current) {
       setObjectKeyValue(inputConfig.object_key || '')
     }
-    if (document.activeElement !== accessKeyIdRef.current) {
+    if (false) {
       setAccessKeyIdValue(inputConfig.access_key_id || '')
     }

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:69:60
     if (document.activeElement !== objectKeyRef.current) {
       setObjectKeyValue(inputConfig.object_key || '')
     }
-    if (document.activeElement !== accessKeyIdRef.current) {
-      setAccessKeyIdValue(inputConfig.access_key_id || '')
-    }
+    if (document.activeElement !== accessKeyIdRef.current) {}
     if (document.activeElement !== secretKeyRef.current) {
       setSecretKeyValue(inputConfig.secret_access_key || '')

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:70:27
       setObjectKeyValue(inputConfig.object_key || '')
     }
     if (document.activeElement !== accessKeyIdRef.current) {
-      setAccessKeyIdValue(inputConfig.access_key_id || '')
+      setAccessKeyIdValue(true)
     }
     if (document.activeElement !== secretKeyRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:70:27
       setObjectKeyValue(inputConfig.object_key || '')
     }
     if (document.activeElement !== accessKeyIdRef.current) {
-      setAccessKeyIdValue(inputConfig.access_key_id || '')
+      setAccessKeyIdValue(false)
     }
     if (document.activeElement !== secretKeyRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:72:9
     if (document.activeElement !== accessKeyIdRef.current) {
       setAccessKeyIdValue(inputConfig.access_key_id || '')
     }
-    if (document.activeElement !== secretKeyRef.current) {
+    if (true) {
       setSecretKeyValue(inputConfig.secret_access_key || '')
     }

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:72:58
     if (document.activeElement !== accessKeyIdRef.current) {
       setAccessKeyIdValue(inputConfig.access_key_id || '')
     }
-    if (document.activeElement !== secretKeyRef.current) {
-      setSecretKeyValue(inputConfig.secret_access_key || '')
-    }
+    if (document.activeElement !== secretKeyRef.current) {}
     if (document.activeElement !== regionRef.current) {
       setRegionValue(inputConfig.region || 'us-east-1')

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:73:25
       setAccessKeyIdValue(inputConfig.access_key_id || '')
     }
     if (document.activeElement !== secretKeyRef.current) {
-      setSecretKeyValue(inputConfig.secret_access_key || '')
+      setSecretKeyValue(inputConfig.secret_access_key && '')
     }
     if (document.activeElement !== regionRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:73:25
       setAccessKeyIdValue(inputConfig.access_key_id || '')
     }
     if (document.activeElement !== secretKeyRef.current) {
-      setSecretKeyValue(inputConfig.secret_access_key || '')
+      setSecretKeyValue(false)
     }
     if (document.activeElement !== regionRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:75:9
     if (document.activeElement !== secretKeyRef.current) {
       setSecretKeyValue(inputConfig.secret_access_key || '')
     }
-    if (document.activeElement !== regionRef.current) {
+    if (false) {
       setRegionValue(inputConfig.region || 'us-east-1')
     }

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:75:9
     if (document.activeElement !== secretKeyRef.current) {
       setSecretKeyValue(inputConfig.secret_access_key || '')
     }
-    if (document.activeElement !== regionRef.current) {
+    if (true) {
       setRegionValue(inputConfig.region || 'us-east-1')
     }

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:76:22
       setSecretKeyValue(inputConfig.secret_access_key || '')
     }
     if (document.activeElement !== regionRef.current) {
-      setRegionValue(inputConfig.region || 'us-east-1')
+      setRegionValue(inputConfig.region && 'us-east-1')
     }
     if (document.activeElement !== projectIdRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:76:22
       setSecretKeyValue(inputConfig.secret_access_key || '')
     }
     if (document.activeElement !== regionRef.current) {
-      setRegionValue(inputConfig.region || 'us-east-1')
+      setRegionValue(true)
     }
     if (document.activeElement !== projectIdRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:78:9
     if (document.activeElement !== regionRef.current) {
       setRegionValue(inputConfig.region || 'us-east-1')
     }
-    if (document.activeElement !== projectIdRef.current) {
+    if (false) {
       setProjectIdValue(inputConfig.project_id || '')
     }

[NoCoverage] EqualityOperator
src/components/editors/InputNodeEditor.tsx:78:9
     if (document.activeElement !== regionRef.current) {
       setRegionValue(inputConfig.region || 'us-east-1')
     }
-    if (document.activeElement !== projectIdRef.current) {
+    if (document.activeElement === projectIdRef.current) {
       setProjectIdValue(inputConfig.project_id || '')
     }

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:79:25
       setRegionValue(inputConfig.region || 'us-east-1')
     }
     if (document.activeElement !== projectIdRef.current) {
-      setProjectIdValue(inputConfig.project_id || '')
+      setProjectIdValue(false)
     }
     if (document.activeElement !== topicNameRef.current) {

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:79:25
       setRegionValue(inputConfig.region || 'us-east-1')
     }
     if (document.activeElement !== projectIdRef.current) {
-      setProjectIdValue(inputConfig.project_id || '')
+      setProjectIdValue(inputConfig.project_id && '')
     }
     if (document.activeElement !== topicNameRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:81:9
     if (document.activeElement !== projectIdRef.current) {
       setProjectIdValue(inputConfig.project_id || '')
     }
-    if (document.activeElement !== topicNameRef.current) {
+    if (false) {
       setTopicNameValue(inputConfig.topic_name || '')
     }

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:81:58
     if (document.activeElement !== projectIdRef.current) {
       setProjectIdValue(inputConfig.project_id || '')
     }
-    if (document.activeElement !== topicNameRef.current) {
-      setTopicNameValue(inputConfig.topic_name || '')
-    }
+    if (document.activeElement !== topicNameRef.current) {}
     if (document.activeElement !== subscriptionNameRef.current) {
       setSubscriptionNameValue(inputConfig.subscription_name || '')

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:82:25
       setProjectIdValue(inputConfig.project_id || '')
     }
     if (document.activeElement !== topicNameRef.current) {
-      setTopicNameValue(inputConfig.topic_name || '')
+      setTopicNameValue(true)
     }
     if (document.activeElement !== subscriptionNameRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:82:25
       setProjectIdValue(inputConfig.project_id || '')
     }
     if (document.activeElement !== topicNameRef.current) {
-      setTopicNameValue(inputConfig.topic_name || '')
+      setTopicNameValue(false)
     }
     if (document.activeElement !== subscriptionNameRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:84:9
     if (document.activeElement !== topicNameRef.current) {
       setTopicNameValue(inputConfig.topic_name || '')
     }
-    if (document.activeElement !== subscriptionNameRef.current) {
+    if (true) {
       setSubscriptionNameValue(inputConfig.subscription_name || '')
     }

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:84:9
     if (document.activeElement !== topicNameRef.current) {
       setTopicNameValue(inputConfig.topic_name || '')
     }
-    if (document.activeElement !== subscriptionNameRef.current) {
+    if (false) {
       setSubscriptionNameValue(inputConfig.subscription_name || '')
     }

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:85:32
       setTopicNameValue(inputConfig.topic_name || '')
     }
     if (document.activeElement !== subscriptionNameRef.current) {
-      setSubscriptionNameValue(inputConfig.subscription_name || '')
+      setSubscriptionNameValue(inputConfig.subscription_name && '')
     }
     if (document.activeElement !== filePathRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:85:32
       setTopicNameValue(inputConfig.topic_name || '')
     }
     if (document.activeElement !== subscriptionNameRef.current) {
-      setSubscriptionNameValue(inputConfig.subscription_name || '')
+      setSubscriptionNameValue(true)
     }
     if (document.activeElement !== filePathRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:87:9
     if (document.activeElement !== subscriptionNameRef.current) {
       setSubscriptionNameValue(inputConfig.subscription_name || '')
     }
-    if (document.activeElement !== filePathRef.current) {
+    if (false) {
       setFilePathValue(inputConfig.file_path || '')
     }

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:87:57
     if (document.activeElement !== subscriptionNameRef.current) {
       setSubscriptionNameValue(inputConfig.subscription_name || '')
     }
-    if (document.activeElement !== filePathRef.current) {
-      setFilePathValue(inputConfig.file_path || '')
-    }
+    if (document.activeElement !== filePathRef.current) {}
     if (document.activeElement !== filePatternRef.current) {
       setFilePatternValue(inputConfig.file_pattern || '')

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:88:24
       setSubscriptionNameValue(inputConfig.subscription_name || '')
     }
     if (document.activeElement !== filePathRef.current) {
-      setFilePathValue(inputConfig.file_path || '')
+      setFilePathValue(false)
     }
     if (document.activeElement !== filePatternRef.current) {

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:88:24
       setSubscriptionNameValue(inputConfig.subscription_name || '')
     }
     if (document.activeElement !== filePathRef.current) {
-      setFilePathValue(inputConfig.file_path || '')
+      setFilePathValue(inputConfig.file_path && '')
     }
     if (document.activeElement !== filePatternRef.current) {

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:90:9
     if (document.activeElement !== filePathRef.current) {
       setFilePathValue(inputConfig.file_path || '')
     }
-    if (document.activeElement !== filePatternRef.current) {
+    if (true) {
       setFilePatternValue(inputConfig.file_pattern || '')
     }

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:90:60
     if (document.activeElement !== filePathRef.current) {
       setFilePathValue(inputConfig.file_path || '')
     }
-    if (document.activeElement !== filePatternRef.current) {
-      setFilePatternValue(inputConfig.file_pattern || '')
-    }
+    if (document.activeElement !== filePatternRef.current) {}
     setModeValue(inputConfig.mode || 'read')
     setOverwriteValue(inputConfig.overwrite ?? true)

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:91:27
       setFilePathValue(inputConfig.file_path || '')
     }
     if (document.activeElement !== filePatternRef.current) {
-      setFilePatternValue(inputConfig.file_pattern || '')
+      setFilePatternValue(inputConfig.file_pattern && '')
     }
     setModeValue(inputConfig.mode || 'read')

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:91:27
       setFilePathValue(inputConfig.file_path || '')
     }
     if (document.activeElement !== filePatternRef.current) {
-      setFilePatternValue(inputConfig.file_pattern || '')
+      setFilePatternValue(true)
     }
     setModeValue(inputConfig.mode || 'read')

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:93:18
     if (document.activeElement !== filePatternRef.current) {
       setFilePatternValue(inputConfig.file_pattern || '')
     }
-    setModeValue(inputConfig.mode || 'read')
+    setModeValue(false)
     setOverwriteValue(inputConfig.overwrite ?? true)
   }, [inputConfig])

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:93:18
     if (document.activeElement !== filePatternRef.current) {
       setFilePatternValue(inputConfig.file_pattern || '')
     }
-    setModeValue(inputConfig.mode || 'read')
+    setModeValue(true)
     setOverwriteValue(inputConfig.overwrite ?? true)
   }, [inputConfig])

[NoCoverage] BooleanLiteral
src/components/editors/InputNodeEditor.tsx:94:48
       setFilePatternValue(inputConfig.file_pattern || '')
     }
     setModeValue(inputConfig.mode || 'read')
-    setOverwriteValue(inputConfig.overwrite ?? true)
+    setOverwriteValue(inputConfig.overwrite ?? false)
   }, [inputConfig])
 

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:94:23
       setFilePatternValue(inputConfig.file_pattern || '')
     }
     setModeValue(inputConfig.mode || 'read')
-    setOverwriteValue(inputConfig.overwrite ?? true)
+    setOverwriteValue(inputConfig.overwrite && true)
   }, [inputConfig])
 

[NoCoverage] ArrayDeclaration
src/components/editors/InputNodeEditor.tsx:95:6
     }
     setModeValue(inputConfig.mode || 'read')
     setOverwriteValue(inputConfig.overwrite ?? true)
-  }, [inputConfig])
+  }, [])
 
   // GCP Bucket Configuration

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:98:7
   }, [inputConfig])
 
   // GCP Bucket Configuration
-  if (node.type === 'gcp_bucket') {
+  if (true) {
     return (
       <div className="border-t pt-4">

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:98:7
   }, [inputConfig])
 
   // GCP Bucket Configuration
-  if (node.type === 'gcp_bucket') {
+  if (false) {
     return (
       <div className="border-t pt-4">

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:107:30
           <select
             id="gcp-bucket-mode"
             value={modeValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setModeValue(newValue)
-              onConfigUpdate('input_config', 'mode', newValue)
-            }}
+            onChange={(e) => {}}
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
             aria-label="Select bucket operation mode"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:110:30
             onChange={(e) => {
               const newValue = e.target.value
               setModeValue(newValue)
-              onConfigUpdate('input_config', 'mode', newValue)
+              onConfigUpdate("", 'mode', newValue)
             }}
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:110:46
             onChange={(e) => {
               const newValue = e.target.value
               setModeValue(newValue)
-              onConfigUpdate('input_config', 'mode', newValue)
+              onConfigUpdate('input_config', "", newValue)
             }}
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:129:30
             ref={bucketNameRef}
             type="text"
             value={bucketNameValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setBucketNameValue(newValue)
-              onConfigUpdate('input_config', 'bucket_name', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="my-bucket-name"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:132:30
             onChange={(e) => {
               const newValue = e.target.value
               setBucketNameValue(newValue)
-              onConfigUpdate('input_config', 'bucket_name', newValue)
+              onConfigUpdate("", 'bucket_name', newValue)
             }}
             placeholder="my-bucket-name"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:132:46
             onChange={(e) => {
               const newValue = e.target.value
               setBucketNameValue(newValue)
-              onConfigUpdate('input_config', 'bucket_name', newValue)
+              onConfigUpdate('input_config', "", newValue)
             }}
             placeholder="my-bucket-name"

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:146:30
             ref={objectPathRef}
             type="text"
             value={objectPathValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setObjectPathValue(newValue)
-              onConfigUpdate('input_config', 'object_path', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="path/to/file.txt or leave blank for all objects"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:149:46
             onChange={(e) => {
               const newValue = e.target.value
               setObjectPathValue(newValue)
-              onConfigUpdate('input_config', 'object_path', newValue)
+              onConfigUpdate('input_config', "", newValue)
             }}
             placeholder="path/to/file.txt or leave blank for all objects"

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:162:30
             id="gcp-credentials"
             ref={gcpCredentialsRef}
             value={gcpCredentialsValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setGcpCredentialsValue(newValue)
-              onConfigUpdate('input_config', 'credentials', newValue)
-            }}
+            onChange={(e) => {}}
             rows={3}
             placeholder="Paste GCP service account JSON credentials"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:165:46
             onChange={(e) => {
               const newValue = e.target.value
               setGcpCredentialsValue(newValue)
-              onConfigUpdate('input_config', 'credentials', newValue)
+              onConfigUpdate('input_config', "", newValue)
             }}
             rows={3}

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:181:7
   }
 
   // AWS S3 Configuration
-  if (node.type === 'aws_s3') {
+  if (false) {
     return (
       <div className="border-t pt-4">

[NoCoverage] EqualityOperator
src/components/editors/InputNodeEditor.tsx:181:7
   }
 
   // AWS S3 Configuration
-  if (node.type === 'aws_s3') {
+  if (node.type !== 'aws_s3') {
     return (
       <div className="border-t pt-4">

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:229:30
             ref={objectKeyRef}
             type="text"
             value={objectKeyValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setObjectKeyValue(newValue)
-              onConfigUpdate('input_config', 'object_key', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="path/to/file.txt or leave blank for all objects"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:232:30
             onChange={(e) => {
               const newValue = e.target.value
               setObjectKeyValue(newValue)
-              onConfigUpdate('input_config', 'object_key', newValue)
+              onConfigUpdate("", 'object_key', newValue)
             }}
             placeholder="path/to/file.txt or leave blank for all objects"

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:246:30
             ref={accessKeyIdRef}
             type="text"
             value={accessKeyIdValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setAccessKeyIdValue(newValue)
-              onConfigUpdate('input_config', 'access_key_id', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="AKIAIOSFODNN7EXAMPLE"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:249:46
             onChange={(e) => {
               const newValue = e.target.value
               setAccessKeyIdValue(newValue)
-              onConfigUpdate('input_config', 'access_key_id', newValue)
+              onConfigUpdate('input_config', "", newValue)
             }}
             placeholder="AKIAIOSFODNN7EXAMPLE"

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:263:30
             ref={secretKeyRef}
             type="password"
             value={secretKeyValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setSecretKeyValue(newValue)
-              onConfigUpdate('input_config', 'secret_access_key', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="wJalrXUtnFEMI/K7MDENG/bPxRfiCYEXAMPLEKEY"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:266:30
             onChange={(e) => {
               const newValue = e.target.value
               setSecretKeyValue(newValue)
-              onConfigUpdate('input_config', 'secret_access_key', newValue)
+              onConfigUpdate("", 'secret_access_key', newValue)
             }}
             placeholder="wJalrXUtnFEMI/K7MDENG/bPxRfiCYEXAMPLEKEY"
