[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:280:30
             ref={regionRef}
             type="text"
             value={regionValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setRegionValue(newValue)
-              onConfigUpdate('input_config', 'region', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="us-east-1"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:283:46
             onChange={(e) => {
               const newValue = e.target.value
               setRegionValue(newValue)
-              onConfigUpdate('input_config', 'region', newValue)
+              onConfigUpdate('input_config', "", newValue)
             }}
             placeholder="us-east-1"

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:295:7
   }
 
   // GCP Pub/Sub Configuration
-  if (node.type === 'gcp_pubsub') {
+  if (false) {
     return (
       <div className="border-t pt-4">

[NoCoverage] EqualityOperator
src/components/editors/InputNodeEditor.tsx:295:7
   }
 
   // GCP Pub/Sub Configuration
-  if (node.type === 'gcp_pubsub') {
+  if (node.type !== 'gcp_pubsub') {
     return (
       <div className="border-t pt-4">

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:326:30
             ref={projectIdRef}
             type="text"
             value={projectIdValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setProjectIdValue(newValue)
-              onConfigUpdate('input_config', 'project_id', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="my-gcp-project"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:329:46
             onChange={(e) => {
               const newValue = e.target.value
               setProjectIdValue(newValue)
-              onConfigUpdate('input_config', 'project_id', newValue)
+              onConfigUpdate('input_config', "", newValue)
             }}
             placeholder="my-gcp-project"

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:343:30
             ref={topicNameRef}
             type="text"
             value={topicNameValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setTopicNameValue(newValue)
-              onConfigUpdate('input_config', 'topic_name', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="my-topic"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:346:46
             onChange={(e) => {
               const newValue = e.target.value
               setTopicNameValue(newValue)
-              onConfigUpdate('input_config', 'topic_name', newValue)
+              onConfigUpdate('input_config', "", newValue)
             }}
             placeholder="my-topic"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:346:30
             onChange={(e) => {
               const newValue = e.target.value
               setTopicNameValue(newValue)
-              onConfigUpdate('input_config', 'topic_name', newValue)
+              onConfigUpdate("", 'topic_name', newValue)
             }}
             placeholder="my-topic"

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:360:30
             ref={subscriptionNameRef}
             type="text"
             value={subscriptionNameValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setSubscriptionNameValue(newValue)
-              onConfigUpdate('input_config', 'subscription_name', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="my-subscription"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] EqualityOperator
src/components/editors/InputNodeEditor.tsx:392:7
   }
 
   // Local FileSystem Configuration
-  if (node.type === 'local_filesystem') {
+  if (node.type !== 'local_filesystem') {
     return (
       <div className="border-t pt-4">

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:392:7
   }
 
   // Local FileSystem Configuration
-  if (node.type === 'local_filesystem') {
+  if (false) {
     return (
       <div className="border-t pt-4">

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:420:30
             ref={filePathRef}
             type="text"
             value={filePathValue}
-            onChange={(e) => {
-              const newValue = e.target.value
-              setFilePathValue(newValue)
-              onConfigUpdate('input_config', 'file_path', newValue)
-            }}
+            onChange={(e) => {}}
             placeholder="/path/to/file.txt"
             className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:423:46
             onChange={(e) => {
               const newValue = e.target.value
               setFilePathValue(newValue)
-              onConfigUpdate('input_config', 'file_path', newValue)
+              onConfigUpdate('input_config', "", newValue)
             }}
             placeholder="/path/to/file.txt"

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:430:10
             aria-label="File system path"
           />
         </div>
-        {modeValue === 'read' && (
-          <div className="mt-3">
-            <label htmlFor="filesystem-pattern" className="block text-sm font-medium text-gray-700 mb-1">File Pattern (optional)</label>
-            <input
-              id="filesystem-pattern"
-              ref={filePatternRef}
-              type="text"
-              value={filePatternValue}
-              onChange={(e) => {
-                const newValue = e.target.value
-                setFilePatternValue(newValue)
-                onConfigUpdate('input_config', 'file_pattern', newValue)
-              }}
-              placeholder="*.txt or leave blank for exact match"
-              className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
-              aria-label="File pattern for matching"
-            />
-          </div>
-        )}
+        {modeValue === 'read' || <div className="mt-3">
+            <label htmlFor="filesystem-pattern" className="block text-sm font-medium text-gray-700 mb-1">File Pattern (optional)</label>
+            <input id="filesystem-pattern" ref={filePatternRef} type="text" value={filePatternValue} onChange={e => {
+    const newValue = e.target.value;
+    setFilePatternValue(newValue);
+    onConfigUpdate('input_config', 'file_pattern', newValue);
+  }} placeholder="*.txt or leave blank for exact match" className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500" aria-label="File pattern for matching" />
+          </div>}
         {modeValue === 'write' && (
           <div className="mt-3">

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:430:10
             aria-label="File system path"
           />
         </div>
-        {modeValue === 'read' && (
-          <div className="mt-3">
-            <label htmlFor="filesystem-pattern" className="block text-sm font-medium text-gray-700 mb-1">File Pattern (optional)</label>
-            <input
-              id="filesystem-pattern"
-              ref={filePatternRef}
-              type="text"
-              value={filePatternValue}
-              onChange={(e) => {
-                const newValue = e.target.value
-                setFilePatternValue(newValue)
-                onConfigUpdate('input_config', 'file_pattern', newValue)
-              }}
-              placeholder="*.txt or leave blank for exact match"
-              className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
-              aria-label="File pattern for matching"
-            />
-          </div>
-        )}
+        {true}
         {modeValue === 'write' && (
           <div className="mt-3">

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:438:32
               ref={filePatternRef}
               type="text"
               value={filePatternValue}
-              onChange={(e) => {
-                const newValue = e.target.value
-                setFilePatternValue(newValue)
-                onConfigUpdate('input_config', 'file_pattern', newValue)
-              }}
+              onChange={(e) => {}}
               placeholder="*.txt or leave blank for exact match"
               className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:441:32
               onChange={(e) => {
                 const newValue = e.target.value
                 setFilePatternValue(newValue)
-                onConfigUpdate('input_config', 'file_pattern', newValue)
+                onConfigUpdate("", 'file_pattern', newValue)
               }}
               placeholder="*.txt or leave blank for exact match"

[NoCoverage] StringLiteral
src/components/editors/InputNodeEditor.tsx:441:48
               onChange={(e) => {
                 const newValue = e.target.value
                 setFilePatternValue(newValue)
-                onConfigUpdate('input_config', 'file_pattern', newValue)
+                onConfigUpdate('input_config', "", newValue)
               }}
               placeholder="*.txt or leave blank for exact match"

[NoCoverage] EqualityOperator
src/components/editors/InputNodeEditor.tsx:449:10
             />
           </div>
         )}
-        {modeValue === 'write' && (
+        {modeValue !== 'write' && (
           <div className="mt-3">
             <label htmlFor="filesystem-overwrite" className="flex items-center gap-2">

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:449:10
             />
           </div>
         )}
-        {modeValue === 'write' && (
-          <div className="mt-3">
-            <label htmlFor="filesystem-overwrite" className="flex items-center gap-2">
-              <input
-                id="filesystem-overwrite"
-                type="checkbox"
-                checked={overwriteValue}
-                onChange={(e) => {
-                  const newValue = e.target.checked
-                  setOverwriteValue(newValue)
-                  onConfigUpdate('input_config', 'overwrite', newValue)
-                }}
-                className="w-4 h-4"
-                aria-label="Overwrite existing file"
-              />
-              <span className="text-sm font-medium text-gray-700">Overwrite existing file</span>
-            </label>
-          </div>
-        )}
+        {false}
       </div>
     )

[NoCoverage] BlockStatement
src/components/editors/InputNodeEditor.tsx:456:34
                 id="filesystem-overwrite"
                 type="checkbox"
                 checked={overwriteValue}
-                onChange={(e) => {
-                  const newValue = e.target.checked
-                  setOverwriteValue(newValue)
-                  onConfigUpdate('input_config', 'overwrite', newValue)
-                }}
+                onChange={(e) => {}}
                 className="w-4 h-4"
                 aria-label="Overwrite existing file"

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:477:10
   return (
     <div className="border-t pt-4">
       <h4 className="text-sm font-semibold text-gray-900 mb-3">
-        {node.type === 'database' && 'Database Configuration'}
+        {false}
         {node.type === 'firebase' && 'Firebase Configuration'}
         {node.type === 'bigquery' && 'BigQuery Configuration'}

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:477:10
   return (
     <div className="border-t pt-4">
       <h4 className="text-sm font-semibold text-gray-900 mb-3">
-        {node.type === 'database' && 'Database Configuration'}
+        {true}
         {node.type === 'firebase' && 'Firebase Configuration'}
         {node.type === 'bigquery' && 'BigQuery Configuration'}

[NoCoverage] ConditionalExpression
src/components/editors/InputNodeEditor.tsx:478:10
     <div className="border-t pt-4">
       <h4 className="text-sm font-semibold text-gray-900 mb-3">
         {node.type === 'database' && 'Database Configuration'}
-        {node.type === 'firebase' && 'Firebase Configuration'}
+        {false}
         {node.type === 'bigquery' && 'BigQuery Configuration'}
       </h4>

[NoCoverage] EqualityOperator
src/components/editors/InputNodeEditor.tsx:478:10
     <div className="border-t pt-4">
       <h4 className="text-sm font-semibold text-gray-900 mb-3">
         {node.type === 'database' && 'Database Configuration'}
-        {node.type === 'firebase' && 'Firebase Configuration'}
+        {node.type !== 'firebase' && 'Firebase Configuration'}
         {node.type === 'bigquery' && 'BigQuery Configuration'}
       </h4>

[NoCoverage] LogicalOperator
src/components/editors/InputNodeEditor.tsx:479:10
       <h4 className="text-sm font-semibold text-gray-900 mb-3">
         {node.type === 'database' && 'Database Configuration'}
         {node.type === 'firebase' && 'Firebase Configuration'}
-        {node.type === 'bigquery' && 'BigQuery Configuration'}
+        {node.type === 'bigquery' || 'BigQuery Configuration'}
       </h4>
       <p className="text-xs text-gray-500">

[NoCoverage] EqualityOperator
src/components/editors/InputNodeEditor.tsx:479:10
       <h4 className="text-sm font-semibold text-gray-900 mb-3">
         {node.type === 'database' && 'Database Configuration'}
         {node.type === 'firebase' && 'Firebase Configuration'}
-        {node.type === 'bigquery' && 'BigQuery Configuration'}
+        {node.type !== 'bigquery' && 'BigQuery Configuration'}
       </h4>
       <p className="text-xs text-gray-500">
