[Survived] BlockStatement
src/components/editors/LoopNodeEditor.tsx:25:19
   const [loopMaxIterationsValue, setLoopMaxIterationsValue] = useState<number>(10)
 
   // Sync local state with node data
-  useEffect(() => {
-    const loopConfig = node.data.loop_config || {}
-    
-    if (document.activeElement !== loopMaxIterationsRef.current) {
-      setLoopMaxIterationsValue(loopConfig.max_iterations ?? 0)
-    }
-  }, [node.data.loop_config])
+  useEffect(() => {}, [node.data.loop_config])
 
   const loopConfig = node.data.loop_config || {}

[Killed] LogicalOperator
src/components/editors/LoopNodeEditor.tsx:26:24
 
   // Sync local state with node data
   useEffect(() => {
-    const loopConfig = node.data.loop_config || {}
+    const loopConfig = node.data.loop_config && {}
     
     if (document.activeElement !== loopMaxIterationsRef.current) {
killedBy: LoopNodeEditor should display current max iterations value
statusReason: expected '0' to be '10' // Object.is equality

[Killed] ConditionalExpression
src/components/editors/LoopNodeEditor.tsx:26:24
 
   // Sync local state with node data
   useEffect(() => {
-    const loopConfig = node.data.loop_config || {}
+    const loopConfig = false
     
     if (document.activeElement !== loopMaxIterationsRef.current) {
killedBy: LoopNodeEditor should display current max iterations value
statusReason: expected '0' to be '10' // Object.is equality

[Survived] ConditionalExpression
src/components/editors/LoopNodeEditor.tsx:28:9
   useEffect(() => {
     const loopConfig = node.data.loop_config || {}
     
-    if (document.activeElement !== loopMaxIterationsRef.current) {
+    if (true) {
       setLoopMaxIterationsValue(loopConfig.max_iterations ?? 0)
     }

[Survived] BlockStatement
src/components/editors/LoopNodeEditor.tsx:28:66
   useEffect(() => {
     const loopConfig = node.data.loop_config || {}
     
-    if (document.activeElement !== loopMaxIterationsRef.current) {
-      setLoopMaxIterationsValue(loopConfig.max_iterations ?? 0)
-    }
+    if (document.activeElement !== loopMaxIterationsRef.current) {}
   }, [node.data.loop_config])
 

[Killed] LogicalOperator
src/components/editors/LoopNodeEditor.tsx:29:33
     const loopConfig = node.data.loop_config || {}
     
     if (document.activeElement !== loopMaxIterationsRef.current) {
-      setLoopMaxIterationsValue(loopConfig.max_iterations ?? 0)
+      setLoopMaxIterationsValue(loopConfig.max_iterations && 0)
     }
   }, [node.data.loop_config])
killedBy: LoopNodeEditor should display current max iterations value
statusReason: expected '0' to be '10' // Object.is equality

[Survived] ConditionalExpression
src/components/editors/LoopNodeEditor.tsx:33:22
     }
   }, [node.data.loop_config])
 
-  const loopConfig = node.data.loop_config || {}
+  const loopConfig = false
   const loopType = loopConfig.loop_type || 'for_each'
 

[Survived] LogicalOperator
src/components/editors/LoopNodeEditor.tsx:33:22
     }
   }, [node.data.loop_config])
 
-  const loopConfig = node.data.loop_config || {}
+  const loopConfig = node.data.loop_config && {}
   const loopType = loopConfig.loop_type || 'for_each'
 

[Survived] LogicalOperator
src/components/editors/LoopNodeEditor.tsx:34:20
   }, [node.data.loop_config])
 
   const loopConfig = node.data.loop_config || {}
-  const loopType = loopConfig.loop_type || 'for_each'
+  const loopType = loopConfig.loop_type && 'for_each'
 
   return (

[Survived] ConditionalExpression
src/components/editors/LoopNodeEditor.tsx:34:20
   }, [node.data.loop_config])
 
   const loopConfig = node.data.loop_config || {}
-  const loopType = loopConfig.loop_type || 'for_each'
+  const loopType = true
 
   return (

[Killed] BlockStatement
src/components/editors/LoopNodeEditor.tsx:49:28
         <select
           id="loop-type"
           value={loopType}
-          onChange={(e) => {
-            const currentLoopConfig = loopConfig
-            onUpdate('loop_config', {
-              loop_type: e.target.value,
-              max_iterations: currentLoopConfig.max_iterations ?? 0,
-              items_source: currentLoopConfig.items_source,
-              condition: currentLoopConfig.condition,
-            })
-          }}
+          onChange={(e) => {}}
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
           aria-label="Select loop type"
killedBy: LoopNodeEditor should call onUpdate when loop type changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'loop_config', ObjectContaining{…} ]

Number of calls: 0

[Killed] ObjectLiteral
src/components/editors/LoopNodeEditor.tsx:51:37
           value={loopType}
           onChange={(e) => {
             const currentLoopConfig = loopConfig
-            onUpdate('loop_config', {
-              loop_type: e.target.value,
-              max_iterations: currentLoopConfig.max_iterations ?? 0,
-              items_source: currentLoopConfig.items_source,
-              condition: currentLoopConfig.condition,
-            })
+            onUpdate('loop_config', {})
           }}
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
killedBy: LoopNodeEditor should call onUpdate when loop type changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'loop_config', ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
    "loop_config",

[Killed] StringLiteral
src/components/editors/LoopNodeEditor.tsx:51:22
           value={loopType}
           onChange={(e) => {
             const currentLoopConfig = loopConfig
-            onUpdate('loop_config', {
+            onUpdate("", {
               loop_type: e.target.value,
               max_iterations: currentLoopConfig.max_iterations ?? 0,
killedBy: LoopNodeEditor should call onUpdate when loop type changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'loop_config', ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   "loop_config",

[Survived] LogicalOperator
src/components/editors/LoopNodeEditor.tsx:53:31
             const currentLoopConfig = loopConfig
             onUpdate('loop_config', {
               loop_type: e.target.value,
-              max_iterations: currentLoopConfig.max_iterations ?? 0,
+              max_iterations: currentLoopConfig.max_iterations && 0,
               items_source: currentLoopConfig.items_source,
               condition: currentLoopConfig.condition,

[Killed] BlockStatement
src/components/editors/LoopNodeEditor.tsx:81:28
           type="number"
           min="0"
           value={loopMaxIterationsValue}
-          onChange={(e) => {
-            const newValue = parseInt(e.target.value) || 0
-            setLoopMaxIterationsValue(newValue)
-            onConfigUpdate('loop_config', 'max_iterations', newValue)
-          }}
+          onChange={(e) => {}}
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
           aria-label="Maximum number of loop iterations"
killedBy: LoopNodeEditor should call onConfigUpdate when max iterations changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'loop_config', 'max_iterations', 20 ]

Number of calls: 0

[Killed] LogicalOperator
src/components/editors/LoopNodeEditor.tsx:82:30
           min="0"
           value={loopMaxIterationsValue}
           onChange={(e) => {
-            const newValue = parseInt(e.target.value) || 0
+            const newValue = parseInt(e.target.value) && 0
             setLoopMaxIterationsValue(newValue)
             onConfigUpdate('loop_config', 'max_iterations', newValue)
killedBy: LoopNodeEditor should call onConfigUpdate when max iterations changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'loop_config', 'max_iterations', 20 ]

Received: 

  1st vi.fn() call:

  [
    "loop_config",

[Killed] ConditionalExpression
src/components/editors/LoopNodeEditor.tsx:82:30
           min="0"
           value={loopMaxIterationsValue}
           onChange={(e) => {
-            const newValue = parseInt(e.target.value) || 0
+            const newValue = true
             setLoopMaxIterationsValue(newValue)
             onConfigUpdate('loop_config', 'max_iterations', newValue)
killedBy: LoopNodeEditor should call onConfigUpdate when max iterations changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'loop_config', 'max_iterations', 20 ]

Received: 

  1st vi.fn() call:

  [
    "loop_config",

[Killed] StringLiteral
src/components/editors/LoopNodeEditor.tsx:84:43
           onChange={(e) => {
             const newValue = parseInt(e.target.value) || 0
             setLoopMaxIterationsValue(newValue)
-            onConfigUpdate('loop_config', 'max_iterations', newValue)
+            onConfigUpdate('loop_config', "", newValue)
           }}
           className="w-full px-3 py-2 border border-gray-300 rounded-lg focus:ring-2 focus:ring-primary-500"
killedBy: LoopNodeEditor should call onConfigUpdate when max iterations changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'loop_config', 'max_iterations', 20 ]

Received: 

  1st vi.fn() call:

  [
    "loop_config",
