[Killed] BlockStatement
src/hooks/useLocalStorage.ts:13:59
   initialValue: T
 ): [T, (value: T | ((val: T) => T)) => void, () => void] {
   // State to store our value
-  const [storedValue, setStoredValue] = useState<T>(() => {
-    if (typeof window === 'undefined') {
-      return initialValue
-    }
-    
-    try {
-      const item = window.localStorage.getItem(key)
-      return item ? JSON.parse(item) : initialValue
-    } catch (error) {
-      logger.error(`Error reading localStorage key "${key}":`, error)
-      return initialValue
-    }
-  })
+  const [storedValue, setStoredValue] = useState<T>(() => {})
 
   // Return a wrapped version of useState's setter function that
killedBy: useLocalStorage useLocalStorage hook should initialize with initial value when localStorage is empty
statusReason: expected undefined to be 'initial' // Object.is equality

[Killed] EqualityOperator
src/hooks/useLocalStorage.ts:14:9
 ): [T, (value: T | ((val: T) => T)) => void, () => void] {
   // State to store our value
   const [storedValue, setStoredValue] = useState<T>(() => {
-    if (typeof window === 'undefined') {
+    if (typeof window !== 'undefined') {
       return initialValue
     }
killedBy: useLocalStorage useLocalStorage hook should initialize with value from localStorage
statusReason: expected 'initial' to be 'stored-value' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:14:9
 ): [T, (value: T | ((val: T) => T)) => void, () => void] {
   // State to store our value
   const [storedValue, setStoredValue] = useState<T>(() => {
-    if (typeof window === 'undefined') {
+    if (true) {
       return initialValue
     }
killedBy: useLocalStorage useLocalStorage hook should initialize with value from localStorage
statusReason: expected 'initial' to be 'stored-value' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:18:9
       return initialValue
     }
     
-    try {
-      const item = window.localStorage.getItem(key)
-      return item ? JSON.parse(item) : initialValue
-    } catch (error) {
+    try {} catch (error) {
       logger.error(`Error reading localStorage key "${key}":`, error)
       return initialValue
killedBy: useLocalStorage useLocalStorage hook should initialize with initial value when localStorage is empty
statusReason: expected undefined to be 'initial' // Object.is equality

[NoCoverage] BlockStatement
src/hooks/useLocalStorage.ts:21:21
     try {
       const item = window.localStorage.getItem(key)
       return item ? JSON.parse(item) : initialValue
-    } catch (error) {
-      logger.error(`Error reading localStorage key "${key}":`, error)
-      return initialValue
-    }
+    } catch (error) {}
   })
 

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:30:37
   // Return a wrapped version of useState's setter function that
   // persists the new value to localStorage.
   const setValue = useCallback(
-    (value: T | ((val: T) => T)) => {
-      try {
-        // Allow value to be a function so we have the same API as useState
-        const valueToStore = value instanceof Function ? value(storedValue) : value
-        
-        // Save state
-        setStoredValue(valueToStore)
-        
-        // Save to local storage
-        if (typeof window !== 'undefined') {
-          window.localStorage.setItem(key, JSON.stringify(valueToStore))
-        }
-      } catch (error) {
-        logger.error(`Error setting localStorage key "${key}":`, error)
-      }
-    },
+    (value: T | ((val: T) => T)) => {},
     [key, storedValue]
   )
killedBy: useLocalStorage useLocalStorage hook should update localStorage when value changes
statusReason: expected 'initial' to be 'new-value' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:31:11
   // persists the new value to localStorage.
   const setValue = useCallback(
     (value: T | ((val: T) => T)) => {
-      try {
-        // Allow value to be a function so we have the same API as useState
-        const valueToStore = value instanceof Function ? value(storedValue) : value
-        
-        // Save state
-        setStoredValue(valueToStore)
-        
-        // Save to local storage
-        if (typeof window !== 'undefined') {
-          window.localStorage.setItem(key, JSON.stringify(valueToStore))
-        }
-      } catch (error) {
+      try {} catch (error) {
         logger.error(`Error setting localStorage key "${key}":`, error)
       }
killedBy: useLocalStorage useLocalStorage hook should update localStorage when value changes
statusReason: expected 'initial' to be 'new-value' // Object.is equality

[Killed] EqualityOperator
src/hooks/useLocalStorage.ts:39:13
         setStoredValue(valueToStore)
         
         // Save to local storage
-        if (typeof window !== 'undefined') {
+        if (typeof window === 'undefined') {
           window.localStorage.setItem(key, JSON.stringify(valueToStore))
         }
killedBy: useLocalStorage useLocalStorage hook should update localStorage when value changes
statusReason: expected null to be '"new-value"' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:39:13
         setStoredValue(valueToStore)
         
         // Save to local storage
-        if (typeof window !== 'undefined') {
+        if (false) {
           window.localStorage.setItem(key, JSON.stringify(valueToStore))
         }
killedBy: useLocalStorage useLocalStorage hook should update localStorage when value changes
statusReason: expected null to be '"new-value"' // Object.is equality

[NoCoverage] BlockStatement
src/hooks/useLocalStorage.ts:42:23
         if (typeof window !== 'undefined') {
           window.localStorage.setItem(key, JSON.stringify(valueToStore))
         }
-      } catch (error) {
-        logger.error(`Error setting localStorage key "${key}":`, error)
-      }
+      } catch (error) {}
     },
     [key, storedValue]

[NoCoverage] StringLiteral
src/hooks/useLocalStorage.ts:43:22
           window.localStorage.setItem(key, JSON.stringify(valueToStore))
         }
       } catch (error) {
-        logger.error(`Error setting localStorage key "${key}":`, error)
+        logger.error(``, error)
       }
     },

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:50:41
   )
 
   // Remove value from localStorage
-  const removeValue = useCallback(() => {
-    try {
-      setStoredValue(initialValue)
-      if (typeof window !== 'undefined') {
-        window.localStorage.removeItem(key)
-      }
-    } catch (error) {
-      logger.error(`Error removing localStorage key "${key}":`, error)
-    }
-  }, [key, initialValue])
+  const removeValue = useCallback(() => {}, [key, initialValue])
 
   // Listen for changes to this key in other tabs/windows
killedBy: useLocalStorage useLocalStorage hook should remove value from localStorage
statusReason: expected 'value' to be 'initial' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:51:9
 
   // Remove value from localStorage
   const removeValue = useCallback(() => {
-    try {
-      setStoredValue(initialValue)
-      if (typeof window !== 'undefined') {
-        window.localStorage.removeItem(key)
-      }
-    } catch (error) {
+    try {} catch (error) {
       logger.error(`Error removing localStorage key "${key}":`, error)
     }
killedBy: useLocalStorage useLocalStorage hook should remove value from localStorage
statusReason: expected 'value' to be 'initial' // Object.is equality

[Killed] EqualityOperator
src/hooks/useLocalStorage.ts:53:11
   const removeValue = useCallback(() => {
     try {
       setStoredValue(initialValue)
-      if (typeof window !== 'undefined') {
+      if (typeof window === 'undefined') {
         window.localStorage.removeItem(key)
       }
killedBy: useLocalStorage useLocalStorage hook should remove value from localStorage
statusReason: expected '"value"' to be null

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:53:11
   const removeValue = useCallback(() => {
     try {
       setStoredValue(initialValue)
-      if (typeof window !== 'undefined') {
+      if (false) {
         window.localStorage.removeItem(key)
       }
killedBy: useLocalStorage useLocalStorage hook should remove value from localStorage
statusReason: expected '"value"' to be null

[NoCoverage] BlockStatement
src/hooks/useLocalStorage.ts:56:21
       if (typeof window !== 'undefined') {
         window.localStorage.removeItem(key)
       }
-    } catch (error) {
-      logger.error(`Error removing localStorage key "${key}":`, error)
-    }
+    } catch (error) {}
   }, [key, initialValue])
 

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:62:19
   }, [key, initialValue])
 
   // Listen for changes to this key in other tabs/windows
-  useEffect(() => {
-    if (typeof window === 'undefined') {
-      return
-    }
-
-    const handleStorageChange = (e: StorageEvent) => {
-      if (e.key === key && e.newValue) {
-        try {
-          setStoredValue(JSON.parse(e.newValue))
-        } catch (error) {
-          logger.error(`Error parsing storage event for key "${key}":`, error)
-        }
-      }
-    }
-
-    window.addEventListener('storage', handleStorageChange)
-    return () => window.removeEventListener('storage', handleStorageChange)
-  }, [key])
+  useEffect(() => {}, [key])
 
   return [storedValue, setValue, removeValue]
killedBy: useLocalStorage useLocalStorage hook should handle storage events from other tabs
statusReason: expected 'initial' to be 'updated-from-tab' // Object.is equality

[Killed] EqualityOperator
src/hooks/useLocalStorage.ts:63:9
 
   // Listen for changes to this key in other tabs/windows
   useEffect(() => {
-    if (typeof window === 'undefined') {
+    if (typeof window !== 'undefined') {
       return
     }
killedBy: useLocalStorage useLocalStorage hook should handle storage events from other tabs
statusReason: expected 'initial' to be 'updated-from-tab' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:63:9
 
   // Listen for changes to this key in other tabs/windows
   useEffect(() => {
-    if (typeof window === 'undefined') {
+    if (true) {
       return
     }
killedBy: useLocalStorage useLocalStorage hook should handle storage events from other tabs
statusReason: expected 'initial' to be 'updated-from-tab' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:67:54
       return
     }
 
-    const handleStorageChange = (e: StorageEvent) => {
-      if (e.key === key && e.newValue) {
-        try {
-          setStoredValue(JSON.parse(e.newValue))
-        } catch (error) {
-          logger.error(`Error parsing storage event for key "${key}":`, error)
-        }
-      }
-    }
+    const handleStorageChange = (e: StorageEvent) => {}
 
     window.addEventListener('storage', handleStorageChange)
killedBy: useLocalStorage useLocalStorage hook should handle storage events from other tabs
statusReason: expected 'initial' to be 'updated-from-tab' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:68:11
     }
 
     const handleStorageChange = (e: StorageEvent) => {
-      if (e.key === key && e.newValue) {
+      if (false) {
         try {
           setStoredValue(JSON.parse(e.newValue))
killedBy: useLocalStorage useLocalStorage hook should handle storage events from other tabs
statusReason: expected 'initial' to be 'updated-from-tab' // Object.is equality

[Killed] EqualityOperator
src/hooks/useLocalStorage.ts:68:11
     }
 
     const handleStorageChange = (e: StorageEvent) => {
-      if (e.key === key && e.newValue) {
+      if (e.key !== key && e.newValue) {
         try {
           setStoredValue(JSON.parse(e.newValue))
killedBy: useLocalStorage useLocalStorage hook should handle storage events from other tabs
statusReason: expected 'initial' to be 'updated-from-tab' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:69:13
 
     const handleStorageChange = (e: StorageEvent) => {
       if (e.key === key && e.newValue) {
-        try {
-          setStoredValue(JSON.parse(e.newValue))
-        } catch (error) {
+        try {} catch (error) {
           logger.error(`Error parsing storage event for key "${key}":`, error)
         }
killedBy: useLocalStorage useLocalStorage hook should handle storage events from other tabs
statusReason: expected 'initial' to be 'updated-from-tab' // Object.is equality

[NoCoverage] BlockStatement
src/hooks/useLocalStorage.ts:71:25
       if (e.key === key && e.newValue) {
         try {
           setStoredValue(JSON.parse(e.newValue))
-        } catch (error) {
-          logger.error(`Error parsing storage event for key "${key}":`, error)
-        }
+        } catch (error) {}
       }
     }

[NoCoverage] StringLiteral
src/hooks/useLocalStorage.ts:72:24
         try {
           setStoredValue(JSON.parse(e.newValue))
         } catch (error) {
-          logger.error(`Error parsing storage event for key "${key}":`, error)
+          logger.error(``, error)
         }
       }

[Killed] StringLiteral
src/hooks/useLocalStorage.ts:77:29
       }
     }
 
-    window.addEventListener('storage', handleStorageChange)
+    window.addEventListener("", handleStorageChange)
     return () => window.removeEventListener('storage', handleStorageChange)
   }, [key])
killedBy: useLocalStorage useLocalStorage hook should handle storage events from other tabs
statusReason: expected 'initial' to be 'updated-from-tab' // Object.is equality

[Survived] ArrowFunction
src/hooks/useLocalStorage.ts:78:12
     }
 
     window.addEventListener('storage', handleStorageChange)
-    return () => window.removeEventListener('storage', handleStorageChange)
+    return () => undefined
   }, [key])
 

[Survived] StringLiteral
src/hooks/useLocalStorage.ts:78:45
     }
 
     window.addEventListener('storage', handleStorageChange)
-    return () => window.removeEventListener('storage', handleStorageChange)
+    return () => window.removeEventListener("", handleStorageChange)
   }, [key])
 

[Killed] ArrayDeclaration
src/hooks/useLocalStorage.ts:81:10
     return () => window.removeEventListener('storage', handleStorageChange)
   }, [key])
 
-  return [storedValue, setValue, removeValue]
+  return []
 }
 
killedBy: useLocalStorage useLocalStorage hook should initialize with initial value when localStorage is empty
statusReason: expected undefined to be 'initial' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:89:7
  * Handles both JSON strings and plain strings (for backward compatibility)
  */
 export function getLocalStorageItem<T>(key: string, defaultValue: T): T {
-  if (typeof window === 'undefined') {
+  if (true) {
     return defaultValue
   }
killedBy: useLocalStorage getLocalStorageItem should return stored value
statusReason: expected 'default' to be 'stored-value' // Object.is equality

[Killed] EqualityOperator
src/hooks/useLocalStorage.ts:89:7
  * Handles both JSON strings and plain strings (for backward compatibility)
  */
 export function getLocalStorageItem<T>(key: string, defaultValue: T): T {
-  if (typeof window === 'undefined') {
+  if (typeof window !== 'undefined') {
     return defaultValue
   }
killedBy: useLocalStorage getLocalStorageItem should return stored value
statusReason: expected 'default' to be 'stored-value' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:95:16
   
   try {
     const item = window.localStorage.getItem(key)
-    if (!item) {
-      return defaultValue
-    }
+    if (!item) {}
     
     // Try to parse as JSON first
killedBy: useLocalStorage getLocalStorageItem should return default value when key does not exist
statusReason: expected null to be 'default' // Object.is equality

[Killed] BooleanLiteral
src/hooks/useLocalStorage.ts:95:9
   
   try {
     const item = window.localStorage.getItem(key)
-    if (!item) {
+    if (item) {
       return defaultValue
     }
killedBy: useLocalStorage getLocalStorageItem should return stored value
statusReason: expected 'default' to be 'stored-value' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:100:9
     }
     
     // Try to parse as JSON first
-    try {
-      return JSON.parse(item)
-    } catch {
+    try {} catch {
       // If JSON.parse fails, it might be a plain string stored directly
       // This can happen if code previously stored values without JSON.stringify
killedBy: useLocalStorage getLocalStorageItem should return stored value
statusReason: expected undefined to be 'stored-value' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:102:13
     // Try to parse as JSON first
     try {
       return JSON.parse(item)
-    } catch {
-      // If JSON.parse fails, it might be a plain string stored directly
-      // This can happen if code previously stored values without JSON.stringify
-      // Check if it looks like it was meant to be JSON (starts with { or [)
-      const looksLikeJson = item.trim().startsWith('{') || item.trim().startsWith('[')
-      
-      if (looksLikeJson) {
-        // Invalid JSON that was meant to be JSON - return default
-        logger.warn(`localStorage key "${key}" contains invalid JSON. Returning default value.`, item)
-        return defaultValue
-      }
-      
-      // Plain string that was stored directly (for backward compatibility)
-      // Only return as-is if default is also a string type
-      if (typeof defaultValue === 'string' || defaultValue === null) {
-        return item as T
-      }
-      
-      // For non-string types, return default
-      logger.warn(`localStorage key "${key}" contains plain string but expected JSON. Returning default value.`, item)
-      return defaultValue
-    }
+    } catch {}
   } catch (error) {
     logger.error(`Error reading localStorage key "${key}":`, error)
killedBy: useLocalStorage getLocalStorageItem should return default value on parse error
statusReason: expected undefined to be 'default' // Object.is equality

[Killed] LogicalOperator
src/hooks/useLocalStorage.ts:106:29
       // If JSON.parse fails, it might be a plain string stored directly
       // This can happen if code previously stored values without JSON.stringify
       // Check if it looks like it was meant to be JSON (starts with { or [)
-      const looksLikeJson = item.trim().startsWith('{') || item.trim().startsWith('[')
+      const looksLikeJson = item.trim().startsWith('{') && item.trim().startsWith('[')
       
       if (looksLikeJson) {
killedBy: useLocalStorage getLocalStorageItem should return default value on parse error
statusReason: expected '{invalid-json}' to be 'default' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:106:29
       // If JSON.parse fails, it might be a plain string stored directly
       // This can happen if code previously stored values without JSON.stringify
       // Check if it looks like it was meant to be JSON (starts with { or [)
-      const looksLikeJson = item.trim().startsWith('{') || item.trim().startsWith('[')
+      const looksLikeJson = true
       
       if (looksLikeJson) {
killedBy: useLocalStorage getLocalStorageItem should return plain string for backward compatibility
statusReason: expected 'default' to be 'plain-string-value' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:108:26
       // Check if it looks like it was meant to be JSON (starts with { or [)
       const looksLikeJson = item.trim().startsWith('{') || item.trim().startsWith('[')
       
-      if (looksLikeJson) {
-        // Invalid JSON that was meant to be JSON - return default
-        logger.warn(`localStorage key "${key}" contains invalid JSON. Returning default value.`, item)
-        return defaultValue
-      }
+      if (looksLikeJson) {}
       
       // Plain string that was stored directly (for backward compatibility)
killedBy: useLocalStorage getLocalStorageItem should return default value on parse error
statusReason: expected '{invalid-json}' to be 'default' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:108:11
       // Check if it looks like it was meant to be JSON (starts with { or [)
       const looksLikeJson = item.trim().startsWith('{') || item.trim().startsWith('[')
       
-      if (looksLikeJson) {
+      if (true) {
         // Invalid JSON that was meant to be JSON - return default
         logger.warn(`localStorage key "${key}" contains invalid JSON. Returning default value.`, item)
killedBy: useLocalStorage getLocalStorageItem should return plain string for backward compatibility
statusReason: expected 'default' to be 'plain-string-value' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:116:11
       
       // Plain string that was stored directly (for backward compatibility)
       // Only return as-is if default is also a string type
-      if (typeof defaultValue === 'string' || defaultValue === null) {
+      if (false) {
         return item as T
       }
killedBy: useLocalStorage getLocalStorageItem should return plain string for backward compatibility
statusReason: expected 'default' to be 'plain-string-value' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:116:11
       
       // Plain string that was stored directly (for backward compatibility)
       // Only return as-is if default is also a string type
-      if (typeof defaultValue === 'string' || defaultValue === null) {
+      if (false || defaultValue === null) {
         return item as T
       }
killedBy: useLocalStorage getLocalStorageItem should return plain string for backward compatibility
statusReason: expected 'default' to be 'plain-string-value' // Object.is equality

[NoCoverage] BlockStatement
src/hooks/useLocalStorage.ts:124:19
       logger.warn(`localStorage key "${key}" contains plain string but expected JSON. Returning default value.`, item)
       return defaultValue
     }
-  } catch (error) {
-    logger.error(`Error reading localStorage key "${key}":`, error)
-    return defaultValue
-  }
+  } catch (error) {}
 }
 

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:133:72
 /**
  * Simple localStorage setter with error handling
  */
-export function setLocalStorageItem<T>(key: string, value: T): boolean {
-  if (typeof window === 'undefined') {
-    return false
-  }
-  
-  try {
-    window.localStorage.setItem(key, JSON.stringify(value))
-    return true
-  } catch (error) {
-    logger.error(`Error setting localStorage key "${key}":`, error)
-    return false
-  }
-}
+export function setLocalStorageItem<T>(key: string, value: T): boolean {}
 
 /**
killedBy: useLocalStorage setLocalStorageItem should set value in localStorage
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:134:7
  * Simple localStorage setter with error handling
  */
 export function setLocalStorageItem<T>(key: string, value: T): boolean {
-  if (typeof window === 'undefined') {
+  if (true) {
     return false
   }
killedBy: useLocalStorage setLocalStorageItem should set value in localStorage
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hooks/useLocalStorage.ts:134:7
  * Simple localStorage setter with error handling
  */
 export function setLocalStorageItem<T>(key: string, value: T): boolean {
-  if (typeof window === 'undefined') {
+  if (typeof window !== 'undefined') {
     return false
   }
killedBy: useLocalStorage setLocalStorageItem should set value in localStorage
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/hooks/useLocalStorage.ts:135:12
  */
 export function setLocalStorageItem<T>(key: string, value: T): boolean {
   if (typeof window === 'undefined') {
-    return false
+    return true
   }
   

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:138:7
     return false
   }
   
-  try {
-    window.localStorage.setItem(key, JSON.stringify(value))
-    return true
-  } catch (error) {
+  try {} catch (error) {
     logger.error(`Error setting localStorage key "${key}":`, error)
     return false
killedBy: useLocalStorage setLocalStorageItem should set value in localStorage
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/useLocalStorage.ts:140:12
   
   try {
     window.localStorage.setItem(key, JSON.stringify(value))
-    return true
+    return false
   } catch (error) {
     logger.error(`Error setting localStorage key "${key}":`, error)
killedBy: useLocalStorage setLocalStorageItem should set value in localStorage
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:141:19
   try {
     window.localStorage.setItem(key, JSON.stringify(value))
     return true
-  } catch (error) {
-    logger.error(`Error setting localStorage key "${key}":`, error)
-    return false
-  }
+  } catch (error) {}
 }
 
killedBy: useLocalStorage setLocalStorageItem should return false on error
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/useLocalStorage.ts:143:12
     return true
   } catch (error) {
     logger.error(`Error setting localStorage key "${key}":`, error)
-    return false
+    return true
   }
 }
killedBy: useLocalStorage setLocalStorageItem should return false on error
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:150:62
 /**
  * Simple localStorage remover with error handling
  */
-export function removeLocalStorageItem(key: string): boolean {
-  if (typeof window === 'undefined') {
-    return false
-  }
-  
-  try {
-    window.localStorage.removeItem(key)
-    return true
-  } catch (error) {
-    logger.error(`Error removing localStorage key "${key}":`, error)
-    return false
-  }
-}
+export function removeLocalStorageItem(key: string): boolean {}
 
 
killedBy: useLocalStorage removeLocalStorageItem should remove value from localStorage
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/useLocalStorage.ts:151:7
  * Simple localStorage remover with error handling
  */
 export function removeLocalStorageItem(key: string): boolean {
-  if (typeof window === 'undefined') {
+  if (true) {
     return false
   }
killedBy: useLocalStorage removeLocalStorageItem should remove value from localStorage
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/hooks/useLocalStorage.ts:151:7
  * Simple localStorage remover with error handling
  */
 export function removeLocalStorageItem(key: string): boolean {
-  if (typeof window === 'undefined') {
+  if (typeof window !== 'undefined') {
     return false
   }
killedBy: useLocalStorage removeLocalStorageItem should remove value from localStorage
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:155:7
     return false
   }
   
-  try {
-    window.localStorage.removeItem(key)
-    return true
-  } catch (error) {
+  try {} catch (error) {
     logger.error(`Error removing localStorage key "${key}":`, error)
     return false
killedBy: useLocalStorage removeLocalStorageItem should remove value from localStorage
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/useLocalStorage.ts:157:12
   
   try {
     window.localStorage.removeItem(key)
-    return true
+    return false
   } catch (error) {
     logger.error(`Error removing localStorage key "${key}":`, error)
killedBy: useLocalStorage removeLocalStorageItem should remove value from localStorage
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:158:19
   try {
     window.localStorage.removeItem(key)
     return true
-  } catch (error) {
-    logger.error(`Error removing localStorage key "${key}":`, error)
-    return false
-  }
+  } catch (error) {}
 }
 
killedBy: useLocalStorage removeLocalStorageItem should return false on error
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/useLocalStorage.ts:160:12
     return true
   } catch (error) {
     logger.error(`Error removing localStorage key "${key}":`, error)
-    return false
+    return true
   }
 }
killedBy: useLocalStorage removeLocalStorageItem should return false on error
statusReason: expected true to be false // Object.is equality
