[NoCoverage] BooleanLiteral
src/hooks/useWebSocket.ts:39:50
   onCompletion,
   onError
 }: UseWebSocketOptions) {
-  const [isConnected, setIsConnected] = useState(false)
+  const [isConnected, setIsConnected] = useState(true)
   const wsRef = useRef<WebSocket | null>(null)
   const reconnectTimeoutRef = useRef<ReturnType<typeof setTimeout> | null>(null)

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:47:23
   const lastKnownStatusRef = useRef<string | undefined>(executionStatus)
 
   const connect = useCallback(() => {
-    if (!executionId) {
-      return
-    }
+    if (!executionId) {}
 
     // Don't connect to temporary execution IDs (they don't exist in backend)

[NoCoverage] BooleanLiteral
src/hooks/useWebSocket.ts:47:9
   const lastKnownStatusRef = useRef<string | undefined>(executionStatus)
 
   const connect = useCallback(() => {
-    if (!executionId) {
+    if (executionId) {
       return
     }

[NoCoverage] MethodExpression
src/hooks/useWebSocket.ts:52:9
     }
 
     // Don't connect to temporary execution IDs (they don't exist in backend)
-    if (executionId.startsWith('pending-')) {
+    if (executionId.endsWith('pending-')) {
       logger.debug(`[WebSocket] Skipping connection to temporary execution ID: ${executionId}`)
       return

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:52:9
     }
 
     // Don't connect to temporary execution IDs (they don't exist in backend)
-    if (executionId.startsWith('pending-')) {
+    if (false) {
       logger.debug(`[WebSocket] Skipping connection to temporary execution ID: ${executionId}`)
       return

[NoCoverage] StringLiteral
src/hooks/useWebSocket.ts:53:20
 
     // Don't connect to temporary execution IDs (they don't exist in backend)
     if (executionId.startsWith('pending-')) {
-      logger.debug(`[WebSocket] Skipping connection to temporary execution ID: ${executionId}`)
+      logger.debug(``)
       return
     }

[NoCoverage] LogicalOperator
src/hooks/useWebSocket.ts:58:27
     }
 
     // Don't connect if execution is already completed or failed
-    const currentStatus = executionStatus || lastKnownStatusRef.current
+    const currentStatus = executionStatus && lastKnownStatusRef.current
     if (currentStatus === 'completed' || currentStatus === 'failed') {
       logger.debug(`[WebSocket] Skipping connection - execution ${executionId} is ${currentStatus}`)

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:58:27
     }
 
     // Don't connect if execution is already completed or failed
-    const currentStatus = executionStatus || lastKnownStatusRef.current
+    const currentStatus = false
     if (currentStatus === 'completed' || currentStatus === 'failed') {
       logger.debug(`[WebSocket] Skipping connection - execution ${executionId} is ${currentStatus}`)

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:59:70
 
     // Don't connect if execution is already completed or failed
     const currentStatus = executionStatus || lastKnownStatusRef.current
-    if (currentStatus === 'completed' || currentStatus === 'failed') {
-      logger.debug(`[WebSocket] Skipping connection - execution ${executionId} is ${currentStatus}`)
-      return
-    }
+    if (currentStatus === 'completed' || currentStatus === 'failed') {}
 
     // Close existing connection if any

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:59:9
 
     // Don't connect if execution is already completed or failed
     const currentStatus = executionStatus || lastKnownStatusRef.current
-    if (currentStatus === 'completed' || currentStatus === 'failed') {
+    if (true) {
       logger.debug(`[WebSocket] Skipping connection - execution ${executionId} is ${currentStatus}`)
       return

[NoCoverage] StringLiteral
src/hooks/useWebSocket.ts:60:20
     // Don't connect if execution is already completed or failed
     const currentStatus = executionStatus || lastKnownStatusRef.current
     if (currentStatus === 'completed' || currentStatus === 'failed') {
-      logger.debug(`[WebSocket] Skipping connection - execution ${executionId} is ${currentStatus}`)
+      logger.debug(``)
       return
     }

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:65:9
     }
 
     // Close existing connection if any
-    if (wsRef.current) {
+    if (true) {
       wsRef.current.close()
       wsRef.current = null

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:65:24
     }
 
     // Close existing connection if any
-    if (wsRef.current) {
-      wsRef.current.close()
-      wsRef.current = null
-    }
+    if (wsRef.current) {}
 
     // Determine WebSocket URL

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:72:22
 
     // Determine WebSocket URL
     // Use /ws path which is proxied by Vite to backend
-    const protocol = window.location.protocol === 'https:' ? 'wss:' : 'ws:'
+    const protocol = false ? 'wss:' : 'ws:'
     const host = window.location.host
     const wsUrl = `${protocol}//${host}/ws/executions/${executionId}`

[NoCoverage] EqualityOperator
src/hooks/useWebSocket.ts:72:22
 
     // Determine WebSocket URL
     // Use /ws path which is proxied by Vite to backend
-    const protocol = window.location.protocol === 'https:' ? 'wss:' : 'ws:'
+    const protocol = window.location.protocol !== 'https:' ? 'wss:' : 'ws:'
     const host = window.location.host
     const wsUrl = `${protocol}//${host}/ws/executions/${executionId}`

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:82:25
       const ws = new WebSocket(wsUrl)
       wsRef.current = ws
 
-      ws.onopen = () => {
-        logger.debug(`[WebSocket] Connected to execution ${executionId}`)
-        setIsConnected(true)
-        reconnectAttempts.current = 0
-      }
+      ws.onopen = () => {}
 
       ws.onmessage = (event) => {

[NoCoverage] StringLiteral
src/hooks/useWebSocket.ts:83:22
       wsRef.current = ws
 
       ws.onopen = () => {
-        logger.debug(`[WebSocket] Connected to execution ${executionId}`)
+        logger.debug(``)
         setIsConnected(true)
         reconnectAttempts.current = 0

[NoCoverage] BooleanLiteral
src/hooks/useWebSocket.ts:84:24
 
       ws.onopen = () => {
         logger.debug(`[WebSocket] Connected to execution ${executionId}`)
-        setIsConnected(true)
+        setIsConnected(false)
         reconnectAttempts.current = 0
       }

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:93:13
           const message: WebSocketMessage = JSON.parse(event.data)
           
           switch (message.type) {
-            case 'log':
-              if (message.log && onLog) {
-                onLog(message.log)
-              }
-              break
+            case 'log':
             case 'status':
               if (message.status && onStatus) {

[NoCoverage] LogicalOperator
src/hooks/useWebSocket.ts:94:19
           
           switch (message.type) {
             case 'log':
-              if (message.log && onLog) {
+              if (message.log || onLog) {
                 onLog(message.log)
               }

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:94:19
           
           switch (message.type) {
             case 'log':
-              if (message.log && onLog) {
+              if (false) {
                 onLog(message.log)
               }

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:98:13
                 onLog(message.log)
               }
               break
-            case 'status':
-              if (message.status && onStatus) {
-                onStatus(message.status)
-              }
-              break
+            case 'status':
             case 'node_update':
               if (message.node_state && onNodeUpdate) {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:99:19
               }
               break
             case 'status':
-              if (message.status && onStatus) {
+              if (true) {
                 onStatus(message.status)
               }

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:99:19
               }
               break
             case 'status':
-              if (message.status && onStatus) {
+              if (false) {
                 onStatus(message.status)
               }

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:103:13
                 onStatus(message.status)
               }
               break
-            case 'node_update':
-              if (message.node_state && onNodeUpdate) {
-                // Extract node_id from message - backend sends it as top-level field
-                const nodeId = (message as any).node_id || message.node_state.node_id || message.node_state.node_id
-                if (nodeId) {
-                  onNodeUpdate(nodeId, message.node_state)
-                }
-              }
-              break
+            case 'node_update':
             case 'completion':
               if (onCompletion) {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:104:19
               }
               break
             case 'node_update':
-              if (message.node_state && onNodeUpdate) {
+              if (true) {
                 // Extract node_id from message - backend sends it as top-level field
                 const nodeId = (message as any).node_id || message.node_state.node_id || message.node_state.node_id

[NoCoverage] LogicalOperator
src/hooks/useWebSocket.ts:104:19
               }
               break
             case 'node_update':
-              if (message.node_state && onNodeUpdate) {
+              if (message.node_state || onNodeUpdate) {
                 // Extract node_id from message - backend sends it as top-level field
                 const nodeId = (message as any).node_id || message.node_state.node_id || message.node_state.node_id

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:106:32
             case 'node_update':
               if (message.node_state && onNodeUpdate) {
                 // Extract node_id from message - backend sends it as top-level field
-                const nodeId = (message as any).node_id || message.node_state.node_id || message.node_state.node_id
+                const nodeId = true
                 if (nodeId) {
                   onNodeUpdate(nodeId, message.node_state)

[NoCoverage] LogicalOperator
src/hooks/useWebSocket.ts:106:32
             case 'node_update':
               if (message.node_state && onNodeUpdate) {
                 // Extract node_id from message - backend sends it as top-level field
-                const nodeId = (message as any).node_id || message.node_state.node_id || message.node_state.node_id
+                const nodeId = ((message as any).node_id || message.node_state.node_id) && message.node_state.node_id
                 if (nodeId) {
                   onNodeUpdate(nodeId, message.node_state)

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:107:21
               if (message.node_state && onNodeUpdate) {
                 // Extract node_id from message - backend sends it as top-level field
                 const nodeId = (message as any).node_id || message.node_state.node_id || message.node_state.node_id
-                if (nodeId) {
+                if (false) {
                   onNodeUpdate(nodeId, message.node_state)
                 }

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:107:29
               if (message.node_state && onNodeUpdate) {
                 // Extract node_id from message - backend sends it as top-level field
                 const nodeId = (message as any).node_id || message.node_state.node_id || message.node_state.node_id
-                if (nodeId) {
-                  onNodeUpdate(nodeId, message.node_state)
-                }
+                if (nodeId) {}
               }
               break

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:112:13
                 }
               }
               break
-            case 'completion':
-              if (onCompletion) {
-                onCompletion(message.result)
-              }
-              break
+            case 'completion':
             case 'error':
               if (message.error && onError) {

[NoCoverage] StringLiteral
src/hooks/useWebSocket.ts:112:18
                 }
               }
               break
-            case 'completion':
+            case "":
               if (onCompletion) {
                 onCompletion(message.result)

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:113:19
               }
               break
             case 'completion':
-              if (onCompletion) {
+              if (false) {
                 onCompletion(message.result)
               }

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:113:33
               }
               break
             case 'completion':
-              if (onCompletion) {
-                onCompletion(message.result)
-              }
+              if (onCompletion) {}
               break
             case 'error':

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:117:13
                 onCompletion(message.result)
               }
               break
-            case 'error':
-              if (message.error && onError) {
-                onError(message.error)
-              }
-              break
+            case 'error':
           }
         } catch (error) {

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:118:45
               }
               break
             case 'error':
-              if (message.error && onError) {
-                onError(message.error)
-              }
+              if (message.error && onError) {}
               break
           }

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:118:19
               }
               break
             case 'error':
-              if (message.error && onError) {
+              if (true) {
                 onError(message.error)
               }

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:123:25
               }
               break
           }
-        } catch (error) {
-          logger.error('[WebSocket] Failed to parse message:', error)
-        }
+        } catch (error) {}
       }
 

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:128:31
         }
       }
 
-      ws.onerror = (error) => {
-        // Extract more details from the error event
-        const errorMessage = error instanceof Error ? error.message : 'Unknown WebSocket error'
-        const wsState = ws.readyState
-        const wsStateText = wsState === WebSocket.CONNECTING ? 'CONNECTING' :
-                           wsState === WebSocket.OPEN ? 'OPEN' :
-                           wsState === WebSocket.CLOSING ? 'CLOSING' :
-                           wsState === WebSocket.CLOSED ? 'CLOSED' : 'UNKNOWN'
-        
-        logger.error(`[WebSocket] Connection error for execution ${executionId}:`, {
-          message: errorMessage,
-          readyState: wsStateText,
-          url: wsUrl
-        })
-        setIsConnected(false)
-      }
+      ws.onerror = (error) => {}
 
       ws.onclose = (event) => {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:132:29
         // Extract more details from the error event
         const errorMessage = error instanceof Error ? error.message : 'Unknown WebSocket error'
         const wsState = ws.readyState
-        const wsStateText = wsState === WebSocket.CONNECTING ? 'CONNECTING' :
+        const wsStateText = true ? 'CONNECTING' :
                            wsState === WebSocket.OPEN ? 'OPEN' :
                            wsState === WebSocket.CLOSING ? 'CLOSING' :

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:132:29
         // Extract more details from the error event
         const errorMessage = error instanceof Error ? error.message : 'Unknown WebSocket error'
         const wsState = ws.readyState
-        const wsStateText = wsState === WebSocket.CONNECTING ? 'CONNECTING' :
+        const wsStateText = false ? 'CONNECTING' :
                            wsState === WebSocket.OPEN ? 'OPEN' :
                            wsState === WebSocket.CLOSING ? 'CLOSING' :

[NoCoverage] EqualityOperator
src/hooks/useWebSocket.ts:133:28
         const errorMessage = error instanceof Error ? error.message : 'Unknown WebSocket error'
         const wsState = ws.readyState
         const wsStateText = wsState === WebSocket.CONNECTING ? 'CONNECTING' :
-                           wsState === WebSocket.OPEN ? 'OPEN' :
+                           wsState !== WebSocket.OPEN ? 'OPEN' :
                            wsState === WebSocket.CLOSING ? 'CLOSING' :
                            wsState === WebSocket.CLOSED ? 'CLOSED' : 'UNKNOWN'

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:133:28
         const errorMessage = error instanceof Error ? error.message : 'Unknown WebSocket error'
         const wsState = ws.readyState
         const wsStateText = wsState === WebSocket.CONNECTING ? 'CONNECTING' :
-                           wsState === WebSocket.OPEN ? 'OPEN' :
+                           true ? 'OPEN' :
                            wsState === WebSocket.CLOSING ? 'CLOSING' :
                            wsState === WebSocket.CLOSED ? 'CLOSED' : 'UNKNOWN'

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:134:28
         const wsState = ws.readyState
         const wsStateText = wsState === WebSocket.CONNECTING ? 'CONNECTING' :
                            wsState === WebSocket.OPEN ? 'OPEN' :
-                           wsState === WebSocket.CLOSING ? 'CLOSING' :
+                           true ? 'CLOSING' :
                            wsState === WebSocket.CLOSED ? 'CLOSED' : 'UNKNOWN'
         

[NoCoverage] EqualityOperator
src/hooks/useWebSocket.ts:134:28
         const wsState = ws.readyState
         const wsStateText = wsState === WebSocket.CONNECTING ? 'CONNECTING' :
                            wsState === WebSocket.OPEN ? 'OPEN' :
-                           wsState === WebSocket.CLOSING ? 'CLOSING' :
+                           wsState !== WebSocket.CLOSING ? 'CLOSING' :
                            wsState === WebSocket.CLOSED ? 'CLOSED' : 'UNKNOWN'
         

[NoCoverage] EqualityOperator
src/hooks/useWebSocket.ts:135:28
         const wsStateText = wsState === WebSocket.CONNECTING ? 'CONNECTING' :
                            wsState === WebSocket.OPEN ? 'OPEN' :
                            wsState === WebSocket.CLOSING ? 'CLOSING' :
-                           wsState === WebSocket.CLOSED ? 'CLOSED' : 'UNKNOWN'
+                           wsState !== WebSocket.CLOSED ? 'CLOSED' : 'UNKNOWN'
         
         logger.error(`[WebSocket] Connection error for execution ${executionId}:`, {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:135:28
         const wsStateText = wsState === WebSocket.CONNECTING ? 'CONNECTING' :
                            wsState === WebSocket.OPEN ? 'OPEN' :
                            wsState === WebSocket.CLOSING ? 'CLOSING' :
-                           wsState === WebSocket.CLOSED ? 'CLOSED' : 'UNKNOWN'
+                           true ? 'CLOSED' : 'UNKNOWN'
         
         logger.error(`[WebSocket] Connection error for execution ${executionId}:`, {

[NoCoverage] BooleanLiteral
src/hooks/useWebSocket.ts:142:24
           readyState: wsStateText,
           url: wsUrl
         })
-        setIsConnected(false)
+        setIsConnected(true)
       }
 

[NoCoverage] StringLiteral
src/hooks/useWebSocket.ts:147:22
 
       ws.onclose = (event) => {
         const { code, reason, wasClean } = event
-        logger.debug(`[WebSocket] Disconnected from execution ${executionId}`, {
+        logger.debug(``, {
           code,
           reason: reason || 'No reason provided',

[NoCoverage] LogicalOperator
src/hooks/useWebSocket.ts:149:19
         const { code, reason, wasClean } = event
         logger.debug(`[WebSocket] Disconnected from execution ${executionId}`, {
           code,
-          reason: reason || 'No reason provided',
+          reason: reason && 'No reason provided',
           wasClean,
           reconnectAttempts: reconnectAttempts.current

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:149:19
         const { code, reason, wasClean } = event
         logger.debug(`[WebSocket] Disconnected from execution ${executionId}`, {
           code,
-          reason: reason || 'No reason provided',
+          reason: false,
           wasClean,
           reconnectAttempts: reconnectAttempts.current

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:157:64
         wsRef.current = null
 
         // Don't reconnect to temporary execution IDs
-        if (executionId && executionId.startsWith('pending-')) {
-          logger.debug(`[WebSocket] Skipping reconnect for temporary execution ID: ${executionId}`)
-          return
-        }
+        if (executionId && executionId.startsWith('pending-')) {}
 
         // Don't reconnect if execution is completed or failed

[NoCoverage] LogicalOperator
src/hooks/useWebSocket.ts:157:13
         wsRef.current = null
 
         // Don't reconnect to temporary execution IDs
-        if (executionId && executionId.startsWith('pending-')) {
+        if (executionId || executionId.startsWith('pending-')) {
           logger.debug(`[WebSocket] Skipping reconnect for temporary execution ID: ${executionId}`)
           return

[NoCoverage] LogicalOperator
src/hooks/useWebSocket.ts:163:31
         }
 
         // Don't reconnect if execution is completed or failed
-        const currentStatus = executionStatus || lastKnownStatusRef.current
+        const currentStatus = executionStatus && lastKnownStatusRef.current
         if (currentStatus === 'completed' || currentStatus === 'failed') {
           logger.debug(`[WebSocket] Skipping reconnect - execution ${executionId} is ${currentStatus}`)

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:163:31
         }
 
         // Don't reconnect if execution is completed or failed
-        const currentStatus = executionStatus || lastKnownStatusRef.current
+        const currentStatus = false
         if (currentStatus === 'completed' || currentStatus === 'failed') {
           logger.debug(`[WebSocket] Skipping reconnect - execution ${executionId} is ${currentStatus}`)

[NoCoverage] LogicalOperator
src/hooks/useWebSocket.ts:164:13
 
         // Don't reconnect if execution is completed or failed
         const currentStatus = executionStatus || lastKnownStatusRef.current
-        if (currentStatus === 'completed' || currentStatus === 'failed') {
+        if (currentStatus === 'completed' && currentStatus === 'failed') {
           logger.debug(`[WebSocket] Skipping reconnect - execution ${executionId} is ${currentStatus}`)
           return

[NoCoverage] StringLiteral
src/hooks/useWebSocket.ts:165:24
         // Don't reconnect if execution is completed or failed
         const currentStatus = executionStatus || lastKnownStatusRef.current
         if (currentStatus === 'completed' || currentStatus === 'failed') {
-          logger.debug(`[WebSocket] Skipping reconnect - execution ${executionId} is ${currentStatus}`)
+          logger.debug(``)
           return
         }

[NoCoverage] EqualityOperator
src/hooks/useWebSocket.ts:170:25
         }
 
         // Don't reconnect if connection was closed cleanly and execution might be done
-        if (wasClean && code === 1000) {
+        if (wasClean && code !== 1000) {
           logger.debug(`[WebSocket] Connection closed cleanly, not reconnecting`)
           return

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:170:40
         }
 
         // Don't reconnect if connection was closed cleanly and execution might be done
-        if (wasClean && code === 1000) {
-          logger.debug(`[WebSocket] Connection closed cleanly, not reconnecting`)
-          return
-        }
+        if (wasClean && code === 1000) {}
 
         // Attempt to reconnect if execution might still be running

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:176:13
         }
 
         // Attempt to reconnect if execution might still be running
-        if (reconnectAttempts.current < maxReconnectAttempts && executionId) {
+        if (false) {
           reconnectAttempts.current++
           const delay = Math.min(1000 * Math.pow(2, reconnectAttempts.current), 10000)

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:176:78
         }
 
         // Attempt to reconnect if execution might still be running
-        if (reconnectAttempts.current < maxReconnectAttempts && executionId) {
-          reconnectAttempts.current++
-          const delay = Math.min(1000 * Math.pow(2, reconnectAttempts.current), 10000)
-          logger.debug(`[WebSocket] Reconnecting in ${delay}ms (attempt ${reconnectAttempts.current}/${maxReconnectAttempts})`)
-          
-          reconnectTimeoutRef.current = setTimeout(() => {
-            connect()
-          }, delay)
-        } else if (reconnectAttempts.current >= maxReconnectAttempts) {
+        if (reconnectAttempts.current < maxReconnectAttempts && executionId) {} else if (reconnectAttempts.current >= maxReconnectAttempts) {
           logger.warn(`[WebSocket] Max reconnect attempts (${maxReconnectAttempts}) reached for execution ${executionId}`)
           if (onError) {

[NoCoverage] UpdateOperator
src/hooks/useWebSocket.ts:177:11
 
         // Attempt to reconnect if execution might still be running
         if (reconnectAttempts.current < maxReconnectAttempts && executionId) {
-          reconnectAttempts.current++
+          reconnectAttempts.current--
           const delay = Math.min(1000 * Math.pow(2, reconnectAttempts.current), 10000)
           logger.debug(`[WebSocket] Reconnecting in ${delay}ms (attempt ${reconnectAttempts.current}/${maxReconnectAttempts})`)

[NoCoverage] MethodExpression
src/hooks/useWebSocket.ts:178:25
         // Attempt to reconnect if execution might still be running
         if (reconnectAttempts.current < maxReconnectAttempts && executionId) {
           reconnectAttempts.current++
-          const delay = Math.min(1000 * Math.pow(2, reconnectAttempts.current), 10000)
+          const delay = Math.max(1000 * Math.pow(2, reconnectAttempts.current), 10000)
           logger.debug(`[WebSocket] Reconnecting in ${delay}ms (attempt ${reconnectAttempts.current}/${maxReconnectAttempts})`)
           

[NoCoverage] ArithmeticOperator
src/hooks/useWebSocket.ts:178:34
         // Attempt to reconnect if execution might still be running
         if (reconnectAttempts.current < maxReconnectAttempts && executionId) {
           reconnectAttempts.current++
-          const delay = Math.min(1000 * Math.pow(2, reconnectAttempts.current), 10000)
+          const delay = Math.min(1000 / Math.pow(2, reconnectAttempts.current), 10000)
           logger.debug(`[WebSocket] Reconnecting in ${delay}ms (attempt ${reconnectAttempts.current}/${maxReconnectAttempts})`)
           

[NoCoverage] StringLiteral
src/hooks/useWebSocket.ts:179:24
         if (reconnectAttempts.current < maxReconnectAttempts && executionId) {
           reconnectAttempts.current++
           const delay = Math.min(1000 * Math.pow(2, reconnectAttempts.current), 10000)
-          logger.debug(`[WebSocket] Reconnecting in ${delay}ms (attempt ${reconnectAttempts.current}/${maxReconnectAttempts})`)
+          logger.debug(``)
           
           reconnectTimeoutRef.current = setTimeout(() => {

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:181:58
           const delay = Math.min(1000 * Math.pow(2, reconnectAttempts.current), 10000)
           logger.debug(`[WebSocket] Reconnecting in ${delay}ms (attempt ${reconnectAttempts.current}/${maxReconnectAttempts})`)
           
-          reconnectTimeoutRef.current = setTimeout(() => {
-            connect()
-          }, delay)
+          reconnectTimeoutRef.current = setTimeout(() => {}, delay)
         } else if (reconnectAttempts.current >= maxReconnectAttempts) {
           logger.warn(`[WebSocket] Max reconnect attempts (${maxReconnectAttempts}) reached for execution ${executionId}`)

[NoCoverage] EqualityOperator
src/hooks/useWebSocket.ts:184:20
           reconnectTimeoutRef.current = setTimeout(() => {
             connect()
           }, delay)
-        } else if (reconnectAttempts.current >= maxReconnectAttempts) {
+        } else if (reconnectAttempts.current < maxReconnectAttempts) {
           logger.warn(`[WebSocket] Max reconnect attempts (${maxReconnectAttempts}) reached for execution ${executionId}`)
           if (onError) {

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:184:71
           reconnectTimeoutRef.current = setTimeout(() => {
             connect()
           }, delay)
-        } else if (reconnectAttempts.current >= maxReconnectAttempts) {
-          logger.warn(`[WebSocket] Max reconnect attempts (${maxReconnectAttempts}) reached for execution ${executionId}`)
-          if (onError) {
-            onError(`WebSocket connection failed after ${maxReconnectAttempts} attempts`)
-          }
-        }
+        } else if (reconnectAttempts.current >= maxReconnectAttempts) {}
       }
     } catch (error) {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:186:15
           }, delay)
         } else if (reconnectAttempts.current >= maxReconnectAttempts) {
           logger.warn(`[WebSocket] Max reconnect attempts (${maxReconnectAttempts}) reached for execution ${executionId}`)
-          if (onError) {
+          if (true) {
             onError(`WebSocket connection failed after ${maxReconnectAttempts} attempts`)
           }
