[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:186:24
           }, delay)
         } else if (reconnectAttempts.current >= maxReconnectAttempts) {
           logger.warn(`[WebSocket] Max reconnect attempts (${maxReconnectAttempts}) reached for execution ${executionId}`)
-          if (onError) {
-            onError(`WebSocket connection failed after ${maxReconnectAttempts} attempts`)
-          }
+          if (onError) {}
         }
       }

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:191:21
           }
         }
       }
-    } catch (error) {
-      logger.error(`[WebSocket] Failed to create connection for execution ${executionId}:`, error)
-      setIsConnected(false)
-      if (onError) {
-        onError(error instanceof Error ? error.message : 'Failed to create WebSocket connection')
-      }
-    }
+    } catch (error) {}
   }, [executionId, executionStatus, onLog, onStatus, onNodeUpdate, onCompletion, onError])
 

[NoCoverage] BooleanLiteral
src/hooks/useWebSocket.ts:193:22
       }
     } catch (error) {
       logger.error(`[WebSocket] Failed to create connection for execution ${executionId}:`, error)
-      setIsConnected(false)
+      setIsConnected(true)
       if (onError) {
         onError(error instanceof Error ? error.message : 'Failed to create WebSocket connection')

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:194:20
     } catch (error) {
       logger.error(`[WebSocket] Failed to create connection for execution ${executionId}:`, error)
       setIsConnected(false)
-      if (onError) {
-        onError(error instanceof Error ? error.message : 'Failed to create WebSocket connection')
-      }
+      if (onError) {}
     }
   }, [executionId, executionStatus, onLog, onStatus, onNodeUpdate, onCompletion, onError])

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:194:11
     } catch (error) {
       logger.error(`[WebSocket] Failed to create connection for execution ${executionId}:`, error)
       setIsConnected(false)
-      if (onError) {
+      if (false) {
         onError(error instanceof Error ? error.message : 'Failed to create WebSocket connection')
       }

[NoCoverage] StringLiteral
src/hooks/useWebSocket.ts:195:58
       logger.error(`[WebSocket] Failed to create connection for execution ${executionId}:`, error)
       setIsConnected(false)
       if (onError) {
-        onError(error instanceof Error ? error.message : 'Failed to create WebSocket connection')
+        onError(error instanceof Error ? error.message : "")
       }
     }

[NoCoverage] ArrayDeclaration
src/hooks/useWebSocket.ts:198:6
         onError(error instanceof Error ? error.message : 'Failed to create WebSocket connection')
       }
     }
-  }, [executionId, executionStatus, onLog, onStatus, onNodeUpdate, onCompletion, onError])
+  }, [])
 
   // Update last known status when it changes

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:201:19
   }, [executionId, executionStatus, onLog, onStatus, onNodeUpdate, onCompletion, onError])
 
   // Update last known status when it changes
-  useEffect(() => {
-    if (executionStatus) {
-      lastKnownStatusRef.current = executionStatus
-      
-      // If execution completed or failed, close connection
-      if (executionStatus === 'completed' || executionStatus === 'failed') {
-        if (wsRef.current) {
-          logger.debug(`[WebSocket] Closing connection - execution ${executionId} is ${executionStatus}`)
-          wsRef.current.close(1000, 'Execution completed')
-          wsRef.current = null
-        }
-        setIsConnected(false)
-        // Clear any pending reconnection attempts
-        if (reconnectTimeoutRef.current) {
-          clearTimeout(reconnectTimeoutRef.current)
-          reconnectTimeoutRef.current = null
-        }
-      }
-    }
-  }, [executionId, executionStatus])
+  useEffect(() => {}, [executionId, executionStatus])
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:202:9
 
   // Update last known status when it changes
   useEffect(() => {
-    if (executionStatus) {
+    if (false) {
       lastKnownStatusRef.current = executionStatus
       

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:202:9
 
   // Update last known status when it changes
   useEffect(() => {
-    if (executionStatus) {
+    if (true) {
       lastKnownStatusRef.current = executionStatus
       

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:206:76
       lastKnownStatusRef.current = executionStatus
       
       // If execution completed or failed, close connection
-      if (executionStatus === 'completed' || executionStatus === 'failed') {
-        if (wsRef.current) {
-          logger.debug(`[WebSocket] Closing connection - execution ${executionId} is ${executionStatus}`)
-          wsRef.current.close(1000, 'Execution completed')
-          wsRef.current = null
-        }
-        setIsConnected(false)
-        // Clear any pending reconnection attempts
-        if (reconnectTimeoutRef.current) {
-          clearTimeout(reconnectTimeoutRef.current)
-          reconnectTimeoutRef.current = null
-        }
-      }
+      if (executionStatus === 'completed' || executionStatus === 'failed') {}
     }
   }, [executionId, executionStatus])

[NoCoverage] EqualityOperator
src/hooks/useWebSocket.ts:206:11
       lastKnownStatusRef.current = executionStatus
       
       // If execution completed or failed, close connection
-      if (executionStatus === 'completed' || executionStatus === 'failed') {
+      if (executionStatus !== 'completed' || executionStatus === 'failed') {
         if (wsRef.current) {
           logger.debug(`[WebSocket] Closing connection - execution ${executionId} is ${executionStatus}`)

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:207:13
       
       // If execution completed or failed, close connection
       if (executionStatus === 'completed' || executionStatus === 'failed') {
-        if (wsRef.current) {
+        if (true) {
           logger.debug(`[WebSocket] Closing connection - execution ${executionId} is ${executionStatus}`)
           wsRef.current.close(1000, 'Execution completed')

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:207:13
       
       // If execution completed or failed, close connection
       if (executionStatus === 'completed' || executionStatus === 'failed') {
-        if (wsRef.current) {
+        if (false) {
           logger.debug(`[WebSocket] Closing connection - execution ${executionId} is ${executionStatus}`)
           wsRef.current.close(1000, 'Execution completed')

[NoCoverage] BooleanLiteral
src/hooks/useWebSocket.ts:212:24
           wsRef.current.close(1000, 'Execution completed')
           wsRef.current = null
         }
-        setIsConnected(false)
+        setIsConnected(true)
         // Clear any pending reconnection attempts
         if (reconnectTimeoutRef.current) {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:214:13
         }
         setIsConnected(false)
         // Clear any pending reconnection attempts
-        if (reconnectTimeoutRef.current) {
+        if (false) {
           clearTimeout(reconnectTimeoutRef.current)
           reconnectTimeoutRef.current = null

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:214:42
         }
         setIsConnected(false)
         // Clear any pending reconnection attempts
-        if (reconnectTimeoutRef.current) {
-          clearTimeout(reconnectTimeoutRef.current)
-          reconnectTimeoutRef.current = null
-        }
+        if (reconnectTimeoutRef.current) {}
       }
     }

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:224:38
 
   useEffect(() => {
     // Clear any pending reconnection attempts when execution ID changes
-    if (reconnectTimeoutRef.current) {
-      clearTimeout(reconnectTimeoutRef.current)
-      reconnectTimeoutRef.current = null
-    }
+    if (reconnectTimeoutRef.current) {}
     
     // Reset reconnect attempts when execution ID changes

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:224:9
 
   useEffect(() => {
     // Clear any pending reconnection attempts when execution ID changes
-    if (reconnectTimeoutRef.current) {
+    if (true) {
       clearTimeout(reconnectTimeoutRef.current)
       reconnectTimeoutRef.current = null

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:232:9
     // Reset reconnect attempts when execution ID changes
     reconnectAttempts.current = 0
     
-    if (executionId) {
+    if (false) {
       // Don't connect to temporary execution IDs
       if (executionId.startsWith('pending-')) {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:232:9
     // Reset reconnect attempts when execution ID changes
     reconnectAttempts.current = 0
     
-    if (executionId) {
+    if (true) {
       // Don't connect to temporary execution IDs
       if (executionId.startsWith('pending-')) {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:234:11
     
     if (executionId) {
       // Don't connect to temporary execution IDs
-      if (executionId.startsWith('pending-')) {
+      if (false) {
         // Close any existing connection
         if (wsRef.current) {

[NoCoverage] MethodExpression
src/hooks/useWebSocket.ts:234:11
     
     if (executionId) {
       // Don't connect to temporary execution IDs
-      if (executionId.startsWith('pending-')) {
+      if (executionId.endsWith('pending-')) {
         // Close any existing connection
         if (wsRef.current) {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:236:13
       // Don't connect to temporary execution IDs
       if (executionId.startsWith('pending-')) {
         // Close any existing connection
-        if (wsRef.current) {
+        if (false) {
           wsRef.current.close()
           wsRef.current = null

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:236:13
       // Don't connect to temporary execution IDs
       if (executionId.startsWith('pending-')) {
         // Close any existing connection
-        if (wsRef.current) {
+        if (true) {
           wsRef.current.close()
           wsRef.current = null

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:245:29
       }
       
       // Don't connect if execution is already completed or failed
-      const currentStatus = executionStatus || lastKnownStatusRef.current
+      const currentStatus = true
       if (currentStatus === 'completed' || currentStatus === 'failed') {
         logger.debug(`[WebSocket] Skipping connection - execution ${executionId} is ${currentStatus}`)

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:252:12
       }
       
       connect()
-    } else {
-      // Close connection if no execution ID
-      if (wsRef.current) {
-        wsRef.current.close()
-        wsRef.current = null
-      }
-      setIsConnected(false)
-    }
+    } else {}
 
     return () => {

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:254:11
       connect()
     } else {
       // Close connection if no execution ID
-      if (wsRef.current) {
+      if (true) {
         wsRef.current.close()
         wsRef.current = null

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:254:11
       connect()
     } else {
       // Close connection if no execution ID
-      if (wsRef.current) {
+      if (false) {
         wsRef.current.close()
         wsRef.current = null

[NoCoverage] BlockStatement
src/hooks/useWebSocket.ts:261:18
       setIsConnected(false)
     }
 
-    return () => {
-      if (reconnectTimeoutRef.current) {
-        clearTimeout(reconnectTimeoutRef.current)
-        reconnectTimeoutRef.current = null
-      }
-      if (wsRef.current) {
-        wsRef.current.close()
-        wsRef.current = null
-      }
-      setIsConnected(false)
-    }
+    return () => {}
   }, [executionId, executionStatus, connect])
 

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:262:11
     }
 
     return () => {
-      if (reconnectTimeoutRef.current) {
+      if (false) {
         clearTimeout(reconnectTimeoutRef.current)
         reconnectTimeoutRef.current = null

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:262:11
     }
 
     return () => {
-      if (reconnectTimeoutRef.current) {
+      if (true) {
         clearTimeout(reconnectTimeoutRef.current)
         reconnectTimeoutRef.current = null

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:266:11
         clearTimeout(reconnectTimeoutRef.current)
         reconnectTimeoutRef.current = null
       }
-      if (wsRef.current) {
+      if (true) {
         wsRef.current.close()
         wsRef.current = null

[NoCoverage] ConditionalExpression
src/hooks/useWebSocket.ts:266:11
         clearTimeout(reconnectTimeoutRef.current)
         reconnectTimeoutRef.current = null
       }
-      if (wsRef.current) {
+      if (false) {
         wsRef.current.close()
         wsRef.current = null
