[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:12:79
  * Makes components easier to test by allowing API injection
  */
 export function useWorkflowAPI() {
-  const getWorkflows = useCallback(async (): Promise<WorkflowDefinition[]> => {
-    try {
-      return await api.getWorkflows()
-    } catch (error) {
-      logger.error('Failed to fetch workflows:', error)
-      throw error
-    }
-  }, [])
+  const getWorkflows = useCallback(async (): Promise<WorkflowDefinition[]> => {}, [])
 
   const getWorkflow = useCallback(async (id: string): Promise<WorkflowDefinition> => {

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:13:9
  */
 export function useWorkflowAPI() {
   const getWorkflows = useCallback(async (): Promise<WorkflowDefinition[]> => {
-    try {
-      return await api.getWorkflows()
-    } catch (error) {
+    try {} catch (error) {
       logger.error('Failed to fetch workflows:', error)
       throw error

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:15:21
   const getWorkflows = useCallback(async (): Promise<WorkflowDefinition[]> => {
     try {
       return await api.getWorkflows()
-    } catch (error) {
-      logger.error('Failed to fetch workflows:', error)
-      throw error
-    }
+    } catch (error) {}
   }, [])
 

[NoCoverage] StringLiteral
src/hooks/useWorkflowAPI.ts:16:20
     try {
       return await api.getWorkflows()
     } catch (error) {
-      logger.error('Failed to fetch workflows:', error)
+      logger.error("", error)
       throw error
     }

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:21:86
     }
   }, [])
 
-  const getWorkflow = useCallback(async (id: string): Promise<WorkflowDefinition> => {
-    try {
-      return await api.getWorkflow(id)
-    } catch (error) {
-      logger.error(`Failed to fetch workflow ${id}:`, error)
-      throw error
-    }
-  }, [])
+  const getWorkflow = useCallback(async (id: string): Promise<WorkflowDefinition> => {}, [])
 
   const createWorkflow = useCallback(async (workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:22:9
   }, [])
 
   const getWorkflow = useCallback(async (id: string): Promise<WorkflowDefinition> => {
-    try {
-      return await api.getWorkflow(id)
-    } catch (error) {
+    try {} catch (error) {
       logger.error(`Failed to fetch workflow ${id}:`, error)
       throw error

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:24:21
   const getWorkflow = useCallback(async (id: string): Promise<WorkflowDefinition> => {
     try {
       return await api.getWorkflow(id)
-    } catch (error) {
-      logger.error(`Failed to fetch workflow ${id}:`, error)
-      throw error
-    }
+    } catch (error) {}
   }, [])
 

[NoCoverage] StringLiteral
src/hooks/useWorkflowAPI.ts:25:20
     try {
       return await api.getWorkflow(id)
     } catch (error) {
-      logger.error(`Failed to fetch workflow ${id}:`, error)
+      logger.error(``, error)
       throw error
     }

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:30:107
     }
   }, [])
 
-  const createWorkflow = useCallback(async (workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {
-    try {
-      return await api.createWorkflow(workflow)
-    } catch (error) {
-      logger.error('Failed to create workflow:', error)
-      throw error
-    }
-  }, [])
+  const createWorkflow = useCallback(async (workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {}, [])
 
   const updateWorkflow = useCallback(async (id: string, workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:31:9
   }, [])
 
   const createWorkflow = useCallback(async (workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {
-    try {
-      return await api.createWorkflow(workflow)
-    } catch (error) {
+    try {} catch (error) {
       logger.error('Failed to create workflow:', error)
       throw error

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:33:21
   const createWorkflow = useCallback(async (workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {
     try {
       return await api.createWorkflow(workflow)
-    } catch (error) {
-      logger.error('Failed to create workflow:', error)
-      throw error
-    }
+    } catch (error) {}
   }, [])
 

[NoCoverage] ArrayDeclaration
src/hooks/useWorkflowAPI.ts:37:6
       logger.error('Failed to create workflow:', error)
       throw error
     }
-  }, [])
+  }, ["Stryker was here"])
 
   const updateWorkflow = useCallback(async (id: string, workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:39:119
     }
   }, [])
 
-  const updateWorkflow = useCallback(async (id: string, workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {
-    try {
-      return await api.updateWorkflow(id, workflow)
-    } catch (error) {
-      logger.error(`Failed to update workflow ${id}:`, error)
-      throw error
-    }
-  }, [])
+  const updateWorkflow = useCallback(async (id: string, workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {}, [])
 
   const deleteWorkflow = useCallback(async (id: string): Promise<void> => {

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:40:9
   }, [])
 
   const updateWorkflow = useCallback(async (id: string, workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {
-    try {
-      return await api.updateWorkflow(id, workflow)
-    } catch (error) {
+    try {} catch (error) {
       logger.error(`Failed to update workflow ${id}:`, error)
       throw error

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:42:21
   const updateWorkflow = useCallback(async (id: string, workflow: WorkflowDefinition): Promise<WorkflowDefinition> => {
     try {
       return await api.updateWorkflow(id, workflow)
-    } catch (error) {
-      logger.error(`Failed to update workflow ${id}:`, error)
-      throw error
-    }
+    } catch (error) {}
   }, [])
 

[NoCoverage] StringLiteral
src/hooks/useWorkflowAPI.ts:43:20
     try {
       return await api.updateWorkflow(id, workflow)
     } catch (error) {
-      logger.error(`Failed to update workflow ${id}:`, error)
+      logger.error(``, error)
       throw error
     }

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:48:75
     }
   }, [])
 
-  const deleteWorkflow = useCallback(async (id: string): Promise<void> => {
-    try {
-      await api.deleteWorkflow(id)
-    } catch (error) {
-      logger.error(`Failed to delete workflow ${id}:`, error)
-      throw error
-    }
-  }, [])
+  const deleteWorkflow = useCallback(async (id: string): Promise<void> => {}, [])
 
   const executeWorkflow = useCallback(async (

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:49:9
   }, [])
 
   const deleteWorkflow = useCallback(async (id: string): Promise<void> => {
-    try {
-      await api.deleteWorkflow(id)
-    } catch (error) {
+    try {} catch (error) {
       logger.error(`Failed to delete workflow ${id}:`, error)
       throw error

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:51:21
   const deleteWorkflow = useCallback(async (id: string): Promise<void> => {
     try {
       await api.deleteWorkflow(id)
-    } catch (error) {
-      logger.error(`Failed to delete workflow ${id}:`, error)
-      throw error
-    }
+    } catch (error) {}
   }, [])
 

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:60:33
   const executeWorkflow = useCallback(async (
     workflowId: string,
     inputs?: Record<string, any>
-  ): Promise<ExecutionState> => {
-    try {
-      return await api.executeWorkflow(workflowId, inputs)
-    } catch (error) {
-      logger.error(`Failed to execute workflow ${workflowId}:`, error)
-      throw error
-    }
-  }, [])
+  ): Promise<ExecutionState> => {}, [])
 
   const getExecution = useCallback(async (executionId: string): Promise<ExecutionState> => {

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:61:9
     workflowId: string,
     inputs?: Record<string, any>
   ): Promise<ExecutionState> => {
-    try {
-      return await api.executeWorkflow(workflowId, inputs)
-    } catch (error) {
+    try {} catch (error) {
       logger.error(`Failed to execute workflow ${workflowId}:`, error)
       throw error

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:63:21
   ): Promise<ExecutionState> => {
     try {
       return await api.executeWorkflow(workflowId, inputs)
-    } catch (error) {
-      logger.error(`Failed to execute workflow ${workflowId}:`, error)
-      throw error
-    }
+    } catch (error) {}
   }, [])
 

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:69:92
     }
   }, [])
 
-  const getExecution = useCallback(async (executionId: string): Promise<ExecutionState> => {
-    try {
-      return await api.getExecution(executionId)
-    } catch (error) {
-      logger.error(`Failed to fetch execution ${executionId}:`, error)
-      throw error
-    }
-  }, [])
+  const getExecution = useCallback(async (executionId: string): Promise<ExecutionState> => {}, [])
 
   return {

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:70:9
   }, [])
 
   const getExecution = useCallback(async (executionId: string): Promise<ExecutionState> => {
-    try {
-      return await api.getExecution(executionId)
-    } catch (error) {
+    try {} catch (error) {
       logger.error(`Failed to fetch execution ${executionId}:`, error)
       throw error

[NoCoverage] BlockStatement
src/hooks/useWorkflowAPI.ts:72:21
   const getExecution = useCallback(async (executionId: string): Promise<ExecutionState> => {
     try {
       return await api.getExecution(executionId)
-    } catch (error) {
-      logger.error(`Failed to fetch execution ${executionId}:`, error)
-      throw error
-    }
+    } catch (error) {}
   }, [])
 
