[Killed] BlockStatement
src/types/nodeData.ts:76:98
 export type NodeWithData = Node<NodeData>
 
 // Type guards
-export function isAgentNode(node: NodeWithData | null): node is NodeWithData & { type: 'agent' } {
-  return node?.type === 'agent'
-}
+export function isAgentNode(node: NodeWithData | null): node is NodeWithData & { type: 'agent' } {}
 
 export function isConditionNode(node: NodeWithData | null): node is NodeWithData & { type: 'condition' } {
killedBy: nodeData type guards isAgentNode should return true for agent nodes
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/types/nodeData.ts:77:10
 
 // Type guards
 export function isAgentNode(node: NodeWithData | null): node is NodeWithData & { type: 'agent' } {
-  return node?.type === 'agent'
+  return true
 }
 
killedBy: nodeData type guards isAgentNode should return false for non-agent nodes
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/types/nodeData.ts:77:10
 
 // Type guards
 export function isAgentNode(node: NodeWithData | null): node is NodeWithData & { type: 'agent' } {
-  return node?.type === 'agent'
+  return false
 }
 
killedBy: nodeData type guards isAgentNode should return true for agent nodes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/types/nodeData.ts:80:106
   return node?.type === 'agent'
 }
 
-export function isConditionNode(node: NodeWithData | null): node is NodeWithData & { type: 'condition' } {
-  return node?.type === 'condition'
-}
+export function isConditionNode(node: NodeWithData | null): node is NodeWithData & { type: 'condition' } {}
 
 export function isLoopNode(node: NodeWithData | null): node is NodeWithData & { type: 'loop' } {
killedBy: nodeData type guards isConditionNode should return true for condition nodes
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/types/nodeData.ts:81:10
 }
 
 export function isConditionNode(node: NodeWithData | null): node is NodeWithData & { type: 'condition' } {
-  return node?.type === 'condition'
+  return node?.type !== 'condition'
 }
 
killedBy: nodeData type guards isConditionNode should return true for condition nodes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/types/nodeData.ts:81:10
 }
 
 export function isConditionNode(node: NodeWithData | null): node is NodeWithData & { type: 'condition' } {
-  return node?.type === 'condition'
+  return false
 }
 
killedBy: nodeData type guards isConditionNode should return true for condition nodes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/types/nodeData.ts:84:96
   return node?.type === 'condition'
 }
 
-export function isLoopNode(node: NodeWithData | null): node is NodeWithData & { type: 'loop' } {
-  return node?.type === 'loop'
-}
+export function isLoopNode(node: NodeWithData | null): node is NodeWithData & { type: 'loop' } {}
 
 export function isInputNode(node: NodeWithData | null): node is NodeWithData & { 
killedBy: nodeData type guards isLoopNode should return true for loop nodes
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/types/nodeData.ts:85:10
 }
 
 export function isLoopNode(node: NodeWithData | null): node is NodeWithData & { type: 'loop' } {
-  return node?.type === 'loop'
+  return node?.type !== 'loop'
 }
 
killedBy: nodeData type guards isLoopNode should return true for loop nodes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/types/nodeData.ts:85:10
 }
 
 export function isLoopNode(node: NodeWithData | null): node is NodeWithData & { type: 'loop' } {
-  return node?.type === 'loop'
+  return false
 }
 
killedBy: nodeData type guards isLoopNode should return true for loop nodes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/types/nodeData.ts:90:3
 
 export function isInputNode(node: NodeWithData | null): node is NodeWithData & { 
   type: 'gcp_bucket' | 'aws_s3' | 'gcp_pubsub' | 'local_filesystem' | 'database' | 'firebase' | 'bigquery'
-} {
-  return node !== null && [
-    'gcp_bucket', 
-    'aws_s3', 
-    'gcp_pubsub', 
-    'local_filesystem', 
-    'database', 
-    'firebase', 
-    'bigquery'
-  ].includes(node.type || '')
-}
+} {}
 
 export function isStartNode(node: NodeWithData | null): node is NodeWithData & { type: 'start' } {
killedBy: nodeData type guards isInputNode should return true for GCP bucket nodes
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/types/nodeData.ts:91:10
 export function isInputNode(node: NodeWithData | null): node is NodeWithData & { 
   type: 'gcp_bucket' | 'aws_s3' | 'gcp_pubsub' | 'local_filesystem' | 'database' | 'firebase' | 'bigquery'
 } {
-  return node !== null && [
-    'gcp_bucket', 
-    'aws_s3', 
-    'gcp_pubsub', 
-    'local_filesystem', 
-    'database', 
-    'firebase', 
-    'bigquery'
-  ].includes(node.type || '')
+  return node !== null || ['gcp_bucket', 'aws_s3', 'gcp_pubsub', 'local_filesystem', 'database', 'firebase', 'bigquery'].includes(node.type || '')
 }
 
killedBy: nodeData type guards isInputNode should return false for non-input nodes
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/types/nodeData.ts:91:10
 export function isInputNode(node: NodeWithData | null): node is NodeWithData & { 
   type: 'gcp_bucket' | 'aws_s3' | 'gcp_pubsub' | 'local_filesystem' | 'database' | 'firebase' | 'bigquery'
 } {
-  return node !== null && [
-    'gcp_bucket', 
-    'aws_s3', 
-    'gcp_pubsub', 
-    'local_filesystem', 
-    'database', 
-    'firebase', 
-    'bigquery'
-  ].includes(node.type || '')
+  return false
 }
 
killedBy: nodeData type guards isInputNode should return true for GCP bucket nodes
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/types/nodeData.ts:92:5
   type: 'gcp_bucket' | 'aws_s3' | 'gcp_pubsub' | 'local_filesystem' | 'database' | 'firebase' | 'bigquery'
 } {
   return node !== null && [
-    'gcp_bucket', 
+    "", 
     'aws_s3', 
     'gcp_pubsub', 
killedBy: nodeData type guards isInputNode should return true for GCP bucket nodes
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/types/nodeData.ts:94:5
   return node !== null && [
     'gcp_bucket', 
     'aws_s3', 
-    'gcp_pubsub', 
+    "", 
     'local_filesystem', 
     'database', 
killedBy: nodeData type guards isInputNode should return true for GCP Pub/Sub nodes
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/types/nodeData.ts:95:5
     'gcp_bucket', 
     'aws_s3', 
     'gcp_pubsub', 
-    'local_filesystem', 
+    "", 
     'database', 
     'firebase', 
killedBy: nodeData type guards isInputNode should return true for local filesystem nodes
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/types/nodeData.ts:97:5
     'gcp_pubsub', 
     'local_filesystem', 
     'database', 
-    'firebase', 
+    "", 
     'bigquery'
   ].includes(node.type || '')
killedBy: nodeData type guards isInputNode should return true for firebase nodes
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/types/nodeData.ts:98:5
     'local_filesystem', 
     'database', 
     'firebase', 
-    'bigquery'
+    ""
   ].includes(node.type || '')
 }
killedBy: nodeData type guards isInputNode should return true for bigquery nodes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/types/nodeData.ts:99:14
     'database', 
     'firebase', 
     'bigquery'
-  ].includes(node.type || '')
+  ].includes(false)
 }
 
killedBy: nodeData type guards isInputNode should return true for GCP bucket nodes
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/types/nodeData.ts:99:14
     'database', 
     'firebase', 
     'bigquery'
-  ].includes(node.type || '')
+  ].includes(node.type && '')
 }
 
killedBy: nodeData type guards isInputNode should return true for GCP bucket nodes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/types/nodeData.ts:102:98
   ].includes(node.type || '')
 }
 
-export function isStartNode(node: NodeWithData | null): node is NodeWithData & { type: 'start' } {
-  return node?.type === 'start'
-}
+export function isStartNode(node: NodeWithData | null): node is NodeWithData & { type: 'start' } {}
 
 export function isEndNode(node: NodeWithData | null): node is NodeWithData & { type: 'end' } {
killedBy: nodeData type guards isStartNode should return true for start nodes
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/types/nodeData.ts:103:10
 }
 
 export function isStartNode(node: NodeWithData | null): node is NodeWithData & { type: 'start' } {
-  return node?.type === 'start'
+  return false
 }
 
killedBy: nodeData type guards isStartNode should return true for start nodes
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/types/nodeData.ts:103:10
 }
 
 export function isStartNode(node: NodeWithData | null): node is NodeWithData & { type: 'start' } {
-  return node?.type === 'start'
+  return node?.type !== 'start'
 }
 
killedBy: nodeData type guards isStartNode should return true for start nodes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/types/nodeData.ts:106:94
   return node?.type === 'start'
 }
 
-export function isEndNode(node: NodeWithData | null): node is NodeWithData & { type: 'end' } {
-  return node?.type === 'end'
-}
+export function isEndNode(node: NodeWithData | null): node is NodeWithData & { type: 'end' } {}
 
 
killedBy: nodeData type guards isEndNode should return true for end nodes
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/types/nodeData.ts:107:10
 }
 
 export function isEndNode(node: NodeWithData | null): node is NodeWithData & { type: 'end' } {
-  return node?.type === 'end'
+  return true
 }
 
killedBy: nodeData type guards isEndNode should return false for non-end nodes
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/types/nodeData.ts:107:10
 }
 
 export function isEndNode(node: NodeWithData | null): node is NodeWithData & { type: 'end' } {
-  return node?.type === 'end'
+  return false
 }
 
killedBy: nodeData type guards isEndNode should return true for end nodes
statusReason: expected false to be true // Object.is equality
