[NoCoverage] StringLiteral
src/utils/confirm.tsx:15:13
   } = {}
 ): Promise<boolean> {
   const {
-    title = 'Confirm',
+    title = "",
     confirmText = 'Confirm',
     cancelText = 'Cancel',

[NoCoverage] StringLiteral
src/utils/confirm.tsx:16:19
 ): Promise<boolean> {
   const {
     title = 'Confirm',
-    confirmText = 'Confirm',
+    confirmText = "",
     cancelText = 'Cancel',
     type = 'warning'

[NoCoverage] StringLiteral
src/utils/confirm.tsx:23:44
 
   return new Promise((resolve) => {
     // Create overlay
-    const overlay = document.createElement('div')
+    const overlay = document.createElement("")
     overlay.style.cssText = `
       position: fixed;

[NoCoverage] ConditionalExpression
src/utils/confirm.tsx:52:9
     `
 
     // Add animation styles if not already added
-    if (!document.getElementById('confirm-dialog-styles')) {
+    if (true) {
       const style = document.createElement('style')
       style.id = 'confirm-dialog-styles'

[NoCoverage] BooleanLiteral
src/utils/confirm.tsx:52:9
     `
 
     // Add animation styles if not already added
-    if (!document.getElementById('confirm-dialog-styles')) {
+    if (document.getElementById('confirm-dialog-styles')) {
       const style = document.createElement('style')
       style.id = 'confirm-dialog-styles'

[NoCoverage] BlockStatement
src/utils/confirm.tsx:119:35
       font-weight: 500;
       transition: all 0.2s;
     `
-    cancelBtn.onmouseover = () => {
-      cancelBtn.style.background = '#f9fafb'
-    }
+    cancelBtn.onmouseover = () => {}
     cancelBtn.onmouseout = () => {
       cancelBtn.style.background = 'white'

[NoCoverage] StringLiteral
src/utils/confirm.tsx:120:36
       transition: all 0.2s;
     `
     cancelBtn.onmouseover = () => {
-      cancelBtn.style.background = '#f9fafb'
+      cancelBtn.style.background = ""
     }
     cancelBtn.onmouseout = () => {

[NoCoverage] BlockStatement
src/utils/confirm.tsx:122:34
     cancelBtn.onmouseover = () => {
       cancelBtn.style.background = '#f9fafb'
     }
-    cancelBtn.onmouseout = () => {
-      cancelBtn.style.background = 'white'
-    }
+    cancelBtn.onmouseout = () => {}
     cancelBtn.onclick = () => {
       overlay.remove()

[NoCoverage] BlockStatement
src/utils/confirm.tsx:125:31
     cancelBtn.onmouseout = () => {
       cancelBtn.style.background = 'white'
     }
-    cancelBtn.onclick = () => {
-      overlay.remove()
-      resolve(false)
-    }
+    cancelBtn.onclick = () => {}
     buttonsContainer.appendChild(cancelBtn)
 

[NoCoverage] BooleanLiteral
src/utils/confirm.tsx:127:15
     }
     cancelBtn.onclick = () => {
       overlay.remove()
-      resolve(false)
+      resolve(true)
     }
     buttonsContainer.appendChild(cancelBtn)

[NoCoverage] StringLiteral
src/utils/confirm.tsx:136:21
     confirmBtn.textContent = confirmText
     const confirmColors = {
       warning: { bg: '#f59e0b', hover: '#d97706' },
-      danger: { bg: '#ef4444', hover: '#dc2626' },
+      danger: { bg: "", hover: '#dc2626' },
       info: { bg: '#3b82f6', hover: '#2563eb' }
     }

[NoCoverage] StringLiteral
src/utils/confirm.tsx:136:39
     confirmBtn.textContent = confirmText
     const confirmColors = {
       warning: { bg: '#f59e0b', hover: '#d97706' },
-      danger: { bg: '#ef4444', hover: '#dc2626' },
+      danger: { bg: '#ef4444', hover: "" },
       info: { bg: '#3b82f6', hover: '#2563eb' }
     }

[NoCoverage] StringLiteral
src/utils/confirm.tsx:137:19
     const confirmColors = {
       warning: { bg: '#f59e0b', hover: '#d97706' },
       danger: { bg: '#ef4444', hover: '#dc2626' },
-      info: { bg: '#3b82f6', hover: '#2563eb' }
+      info: { bg: "", hover: '#2563eb' }
     }
     const colors = confirmColors[type]

[NoCoverage] StringLiteral
src/utils/confirm.tsx:137:37
     const confirmColors = {
       warning: { bg: '#f59e0b', hover: '#d97706' },
       danger: { bg: '#ef4444', hover: '#dc2626' },
-      info: { bg: '#3b82f6', hover: '#2563eb' }
+      info: { bg: '#3b82f6', hover: "" }
     }
     const colors = confirmColors[type]

[NoCoverage] StringLiteral
src/utils/confirm.tsx:140:32
       info: { bg: '#3b82f6', hover: '#2563eb' }
     }
     const colors = confirmColors[type]
-    confirmBtn.style.cssText = `
-      padding: 8px 16px;
-      border: none;
-      background: ${colors.bg};
-      color: white;
-      border-radius: 6px;
-      cursor: pointer;
-      font-size: 14px;
-      font-weight: 500;
-      transition: all 0.2s;
-    `
+    confirmBtn.style.cssText = ``
     confirmBtn.onmouseover = () => {
       confirmBtn.style.background = colors.hover

[NoCoverage] BlockStatement
src/utils/confirm.tsx:151:36
       font-weight: 500;
       transition: all 0.2s;
     `
-    confirmBtn.onmouseover = () => {
-      confirmBtn.style.background = colors.hover
-    }
+    confirmBtn.onmouseover = () => {}
     confirmBtn.onmouseout = () => {
       confirmBtn.style.background = colors.bg

[NoCoverage] BlockStatement
src/utils/confirm.tsx:154:35
     confirmBtn.onmouseover = () => {
       confirmBtn.style.background = colors.hover
     }
-    confirmBtn.onmouseout = () => {
-      confirmBtn.style.background = colors.bg
-    }
+    confirmBtn.onmouseout = () => {}
     confirmBtn.onclick = () => {
       overlay.remove()

[NoCoverage] BlockStatement
src/utils/confirm.tsx:157:32
     confirmBtn.onmouseout = () => {
       confirmBtn.style.background = colors.bg
     }
-    confirmBtn.onclick = () => {
-      overlay.remove()
-      resolve(true)
-    }
+    confirmBtn.onclick = () => {}
     buttonsContainer.appendChild(confirmBtn)
 

[NoCoverage] BooleanLiteral
src/utils/confirm.tsx:159:15
     }
     confirmBtn.onclick = () => {
       overlay.remove()
-      resolve(true)
+      resolve(false)
     }
     buttonsContainer.appendChild(confirmBtn)

[NoCoverage] BlockStatement
src/utils/confirm.tsx:164:30
     buttonsContainer.appendChild(confirmBtn)
 
     // Close on overlay click
-    overlay.onclick = (e) => {
-      if (e.target === overlay) {
-        overlay.remove()
-        resolve(false)
-      }
-    }
+    overlay.onclick = (e) => {}
 
     // Add to DOM

[NoCoverage] BlockStatement
src/utils/confirm.tsx:165:33
 
     // Close on overlay click
     overlay.onclick = (e) => {
-      if (e.target === overlay) {
-        overlay.remove()
-        resolve(false)
-      }
+      if (e.target === overlay) {}
     }
 

[NoCoverage] ConditionalExpression
src/utils/confirm.tsx:165:11
 
     // Close on overlay click
     overlay.onclick = (e) => {
-      if (e.target === overlay) {
+      if (true) {
         overlay.remove()
         resolve(false)
