[Killed] LogicalOperator
src/utils/logger.ts:1:15
-const isDev = import.meta.env.DEV || process.env.NODE_ENV === 'development'
+const isDev = import.meta.env.DEV && process.env.NODE_ENV === 'development'
 
 export const logger = {
killedBy: logger debug should log in development mode
statusReason: expected "log" to be called with arguments: [ '[DEBUG]', 'test message' ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/logger.ts:1:15
-const isDev = import.meta.env.DEV || process.env.NODE_ENV === 'development'
+const isDev = false
 
 export const logger = {
killedBy: logger debug should log in development mode
statusReason: expected "log" to be called with arguments: [ '[DEBUG]', 'test message' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.ts:4:30
 const isDev = import.meta.env.DEV || process.env.NODE_ENV === 'development'
 
 export const logger = {
-  debug: (...args: any[]) => {
-    if (isDev) {
-      console.log('[DEBUG]', ...args)
-    }
-  },
+  debug: (...args: any[]) => {},
   
   info: (...args: any[]) => {
killedBy: logger debug should log in development mode
statusReason: expected "log" to be called with arguments: [ '[DEBUG]', 'test message' ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/logger.ts:5:9
 
 export const logger = {
   debug: (...args: any[]) => {
-    if (isDev) {
+    if (false) {
       console.log('[DEBUG]', ...args)
     }
killedBy: logger debug should log in development mode
statusReason: expected "log" to be called with arguments: [ '[DEBUG]', 'test message' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.ts:5:16
 
 export const logger = {
   debug: (...args: any[]) => {
-    if (isDev) {
-      console.log('[DEBUG]', ...args)
-    }
+    if (isDev) {}
   },
   
killedBy: logger debug should log in development mode
statusReason: expected "log" to be called with arguments: [ '[DEBUG]', 'test message' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.ts:10:29
     }
   },
   
-  info: (...args: any[]) => {
-    if (isDev) {
-      console.info('[INFO]', ...args)
-    }
-  },
+  info: (...args: any[]) => {},
   
   warn: (...args: any[]) => {
killedBy: logger info should log in development mode
statusReason: expected "info" to be called with arguments: [ '[INFO]', 'test message' ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/logger.ts:11:9
   },
   
   info: (...args: any[]) => {
-    if (isDev) {
+    if (false) {
       console.info('[INFO]', ...args)
     }
killedBy: logger info should log in development mode
statusReason: expected "info" to be called with arguments: [ '[INFO]', 'test message' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.ts:11:16
   },
   
   info: (...args: any[]) => {
-    if (isDev) {
-      console.info('[INFO]', ...args)
-    }
+    if (isDev) {}
   },
   
killedBy: logger info should log in development mode
statusReason: expected "info" to be called with arguments: [ '[INFO]', 'test message' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.ts:16:29
     }
   },
   
-  warn: (...args: any[]) => {
-    console.warn('[WARN]', ...args)
-  },
+  warn: (...args: any[]) => {},
   
   error: (...args: any[]) => {
killedBy: logger warn should always log warnings
statusReason: expected "warn" to be called with arguments: [ '[WARN]', 'warning message' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.ts:20:30
     console.warn('[WARN]', ...args)
   },
   
-  error: (...args: any[]) => {
-    console.error('[ERROR]', ...args)
-  },
+  error: (...args: any[]) => {},
   
   log: (...args: any[]) => {
killedBy: logger error should always log errors
statusReason: expected "error" to be called with arguments: [ '[ERROR]', 'error message' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.ts:24:28
     console.error('[ERROR]', ...args)
   },
   
-  log: (...args: any[]) => {
-    if (isDev) {
-      console.log(...args)
-    }
-  },
+  log: (...args: any[]) => {},
 }
 
killedBy: logger log should log in development mode
statusReason: expected "log" to be called with arguments: [ 'test message' ]

Number of calls: 0

[Killed] BlockStatement
src/utils/logger.ts:25:16
   },
   
   log: (...args: any[]) => {
-    if (isDev) {
-      console.log(...args)
-    }
+    if (isDev) {}
   },
 }
killedBy: logger log should log in development mode
statusReason: expected "log" to be called with arguments: [ 'test message' ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/logger.ts:25:9
   },
   
   log: (...args: any[]) => {
-    if (isDev) {
+    if (false) {
       console.log(...args)
     }
killedBy: logger log should log in development mode
statusReason: expected "log" to be called with arguments: [ 'test message' ]

Number of calls: 0
