[NoCoverage] StringLiteral
src/utils/notifications.ts:12:35
  * Show a non-blocking notification toast
  */
 export function showNotification(message: string, options: NotificationOptions = {}) {
-  const { duration = 5000, type = 'info' } = options
+  const { duration = 5000, type = "" } = options
 
   const colors = {

[NoCoverage] StringLiteral
src/utils/notifications.ts:16:35
 
   const colors = {
     success: { bg: '#10b981', text: 'white' },
-    error: { bg: '#ef4444', text: 'white' },
+    error: { bg: '#ef4444', text: "" },
     info: { bg: '#3b82f6', text: 'white' },
     warning: { bg: '#f59e0b', text: 'white' }

[NoCoverage] ObjectLiteral
src/utils/notifications.ts:16:12
 
   const colors = {
     success: { bg: '#10b981', text: 'white' },
-    error: { bg: '#ef4444', text: 'white' },
+    error: {},
     info: { bg: '#3b82f6', text: 'white' },
     warning: { bg: '#f59e0b', text: 'white' }

[NoCoverage] StringLiteral
src/utils/notifications.ts:23:47
 
   const color = colors[type]
 
-  const notification = document.createElement('div')
+  const notification = document.createElement("")
   notification.style.cssText = `
     position: fixed;

[NoCoverage] BlockStatement
src/utils/notifications.ts:41:56
   `
 
   // Add animation keyframes if not already added
-  if (!document.getElementById('notification-styles')) {
-    const style = document.createElement('style')
-    style.id = 'notification-styles'
-    style.textContent = `
-      @keyframes slideIn {
-        from {
-          transform: translateX(100%);
-          opacity: 0;
-        }
-        to {
-          transform: translateX(0);
-          opacity: 1;
-        }
-      }
-    `
-    document.head.appendChild(style)
-  }
+  if (!document.getElementById('notification-styles')) {}
 
   notification.textContent = message

[NoCoverage] BooleanLiteral
src/utils/notifications.ts:41:7
   `
 
   // Add animation keyframes if not already added
-  if (!document.getElementById('notification-styles')) {
+  if (document.getElementById('notification-styles')) {
     const style = document.createElement('style')
     style.id = 'notification-styles'

[NoCoverage] BlockStatement
src/utils/notifications.ts:63:20
   document.body.appendChild(notification)
 
   // Auto-remove after duration
-  setTimeout(() => {
-    notification.style.transition = 'opacity 0.3s, transform 0.3s'
-    notification.style.opacity = '0'
-    notification.style.transform = 'translateX(100%)'
-    setTimeout(() => notification.remove(), 300)
-  }, duration)
+  setTimeout(() => {}, duration)
 
   return notification

[NoCoverage] StringLiteral
src/utils/notifications.ts:64:37
 
   // Auto-remove after duration
   setTimeout(() => {
-    notification.style.transition = 'opacity 0.3s, transform 0.3s'
+    notification.style.transition = ""
     notification.style.opacity = '0'
     notification.style.transform = 'translateX(100%)'

[NoCoverage] StringLiteral
src/utils/notifications.ts:66:36
   setTimeout(() => {
     notification.style.transition = 'opacity 0.3s, transform 0.3s'
     notification.style.opacity = '0'
-    notification.style.transform = 'translateX(100%)'
+    notification.style.transform = ""
     setTimeout(() => notification.remove(), 300)
   }, duration)

[NoCoverage] ArrowFunction
src/utils/notifications.ts:67:16
     notification.style.transition = 'opacity 0.3s, transform 0.3s'
     notification.style.opacity = '0'
     notification.style.transform = 'translateX(100%)'
-    setTimeout(() => notification.remove(), 300)
+    setTimeout(() => undefined, 300)
   }, duration)
 

[NoCoverage] BlockStatement
src/utils/notifications.ts:76:65
 /**
  * Show a success notification
  */
-export function showSuccess(message: string, duration?: number) {
-  return showNotification(message, { type: 'success', duration })
-}
+export function showSuccess(message: string, duration?: number) {}
 
 /**

[NoCoverage] ObjectLiteral
src/utils/notifications.ts:77:36
  * Show a success notification
  */
 export function showSuccess(message: string, duration?: number) {
-  return showNotification(message, { type: 'success', duration })
+  return showNotification(message, {})
 }
 

[NoCoverage] StringLiteral
src/utils/notifications.ts:77:44
  * Show a success notification
  */
 export function showSuccess(message: string, duration?: number) {
-  return showNotification(message, { type: 'success', duration })
+  return showNotification(message, { type: "", duration })
 }
 

[NoCoverage] BlockStatement
src/utils/notifications.ts:83:63
 /**
  * Show an error notification
  */
-export function showError(message: string, duration?: number) {
-  return showNotification(message, { type: 'error', duration })
-}
+export function showError(message: string, duration?: number) {}
 
 /**

[NoCoverage] BlockStatement
src/utils/notifications.ts:90:62
 /**
  * Show an info notification
  */
-export function showInfo(message: string, duration?: number) {
-  return showNotification(message, { type: 'info', duration })
-}
+export function showInfo(message: string, duration?: number) {}
 
 /**

[NoCoverage] BlockStatement
src/utils/notifications.ts:97:65
 /**
  * Show a warning notification
  */
-export function showWarning(message: string, duration?: number) {
-  return showNotification(message, { type: 'warning', duration })
-}
+export function showWarning(message: string, duration?: number) {}
 
 

[NoCoverage] ObjectLiteral
src/utils/notifications.ts:98:36
  * Show a warning notification
  */
 export function showWarning(message: string, duration?: number) {
-  return showNotification(message, { type: 'warning', duration })
+  return showNotification(message, {})
 }
 
