[Survived] StringLiteral
src/components/ExecutionStatusBadge.tsx:11:13
 
 export default function ExecutionStatusBadge({ 
   status, 
-  variant = 'dark',
+  variant = "",
   className = '' 
 }: ExecutionStatusBadgeProps) {

[Killed] BlockStatement
src/components/ExecutionStatusBadge.tsx:13:31
   status, 
   variant = 'dark',
   className = '' 
-}: ExecutionStatusBadgeProps) {
-  const normalizedStatus = isValidExecutionStatus(status) ? status : 'pending'
-  const colorClasses = variant === 'light' 
-    ? getExecutionStatusColorLight(normalizedStatus)
-    : getExecutionStatusColor(normalizedStatus)
-  
-  return (
-    <div className={`px-3 py-1 rounded text-sm font-medium ${colorClasses} ${className}`}>
-      {normalizedStatus}
-    </div>
-  )
-}
+}: ExecutionStatusBadgeProps) {}
 
 
killedBy: ExecutionStatusBadge should render completed status
statusReason: Unable to find an element with the text: completed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] EqualityOperator
src/components/ExecutionStatusBadge.tsx:15:24
   className = '' 
 }: ExecutionStatusBadgeProps) {
   const normalizedStatus = isValidExecutionStatus(status) ? status : 'pending'
-  const colorClasses = variant === 'light' 
+  const colorClasses = variant !== 'light' 
     ? getExecutionStatusColorLight(normalizedStatus)
     : getExecutionStatusColor(normalizedStatus)
killedBy: ExecutionStatusBadge should use dark variant by default
statusReason: expected 'px-3 py-1 rounded text-sm font-medium…' to contain 'bg-green-900'

[Killed] ConditionalExpression
src/components/ExecutionStatusBadge.tsx:15:24
   className = '' 
 }: ExecutionStatusBadgeProps) {
   const normalizedStatus = isValidExecutionStatus(status) ? status : 'pending'
-  const colorClasses = variant === 'light' 
+  const colorClasses = false 
     ? getExecutionStatusColorLight(normalizedStatus)
     : getExecutionStatusColor(normalizedStatus)
killedBy: ExecutionStatusBadge should use light variant when specified
statusReason: expected 'px-3 py-1 rounded text-sm font-medium…' to contain 'bg-green-100'

[Killed] StringLiteral
src/components/ExecutionStatusBadge.tsx:20:21
     : getExecutionStatusColor(normalizedStatus)
   
   return (
-    <div className={`px-3 py-1 rounded text-sm font-medium ${colorClasses} ${className}`}>
+    <div className={``}>
       {normalizedStatus}
     </div>
killedBy: ExecutionStatusBadge should use dark variant by default
statusReason: expected '' to contain 'bg-green-900'
