[Killed] BooleanLiteral
src/components/LogLevelBadge.tsx:11:20
 
 export default function LogLevelBadge({ 
   level, 
-  showBackground = true,
+  showBackground = false,
   className = '' 
 }: LogLevelBadgeProps) {
killedBy: LogLevelBadge should show background by default
statusReason: expected 'font-semibold text-red-400 ' to contain 'bg-red-900/30'

[Killed] BlockStatement
src/components/LogLevelBadge.tsx:13:24
   level, 
   showBackground = true,
   className = '' 
-}: LogLevelBadgeProps) {
-  const normalizedLevel = isValidLogLevel(level) ? level : 'INFO'
-  const colorClasses = showBackground 
-    ? getLogLevelColor(normalizedLevel)
-    : ''
-  const textColor = getLogLevelTextColor(normalizedLevel)
-  
-  return (
-    <span className={`font-semibold ${showBackground ? colorClasses : textColor} ${className}`}>
-      {normalizedLevel}
-    </span>
-  )
-}
+}: LogLevelBadgeProps) {}
 
 
killedBy: LogLevelBadge should render ERROR level
statusReason: Unable to find an element with the text: ERROR. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
src/components/LogLevelBadge.tsx:14:60
   showBackground = true,
   className = '' 
 }: LogLevelBadgeProps) {
-  const normalizedLevel = isValidLogLevel(level) ? level : 'INFO'
+  const normalizedLevel = isValidLogLevel(level) ? level : ""
   const colorClasses = showBackground 
     ? getLogLevelColor(normalizedLevel)
killedBy: LogLevelBadge should normalize invalid level to INFO
statusReason: Unable to find an element with the text: INFO. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      class="font-semibold bg-gray-800 text-gray-300 "
    />
