[Killed] BlockStatement
src/utils/executionStatus.ts:6:68
 /**
  * Get Tailwind CSS classes for execution status badge
  */
-export const getExecutionStatusColor = (status: string): string => {
-  const statusMap: Record<string, string> = {
-    completed: 'bg-green-900 text-green-200',
-    failed: 'bg-red-900 text-red-200',
-    running: 'bg-blue-900 text-blue-200',
-    pending: 'bg-yellow-900 text-yellow-200',
-    paused: 'bg-gray-900 text-gray-200',
-  }
-  return statusMap[status] || 'bg-gray-900 text-gray-200'
-}
+export const getExecutionStatusColor = (status: string): string => {}
 
 /**
killedBy: ExecutionStatusBadge should use dark variant by default
statusReason: expected 'px-3 py-1 rounded text-sm font-medium…' to contain 'bg-green-900'

[Killed] StringLiteral
src/utils/executionStatus.ts:11:14
     completed: 'bg-green-900 text-green-200',
     failed: 'bg-red-900 text-red-200',
     running: 'bg-blue-900 text-blue-200',
-    pending: 'bg-yellow-900 text-yellow-200',
+    pending: "",
     paused: 'bg-gray-900 text-gray-200',
   }
killedBy: executionStatus utilities getExecutionStatusColor should return correct color for pending status
statusReason: expected 'bg-gray-900 text-gray-200' to be 'bg-yellow-900 text-yellow-200' // Object.is equality

[Survived] StringLiteral
src/utils/executionStatus.ts:12:13
     failed: 'bg-red-900 text-red-200',
     running: 'bg-blue-900 text-blue-200',
     pending: 'bg-yellow-900 text-yellow-200',
-    paused: 'bg-gray-900 text-gray-200',
+    paused: "",
   }
   return statusMap[status] || 'bg-gray-900 text-gray-200'

[Killed] LogicalOperator
src/utils/executionStatus.ts:14:10
     pending: 'bg-yellow-900 text-yellow-200',
     paused: 'bg-gray-900 text-gray-200',
   }
-  return statusMap[status] || 'bg-gray-900 text-gray-200'
+  return statusMap[status] && 'bg-gray-900 text-gray-200'
 }
 
killedBy: ExecutionStatusBadge should use dark variant by default
statusReason: expected 'px-3 py-1 rounded text-sm font-medium…' to contain 'bg-green-900'

[Killed] ConditionalExpression
src/utils/executionStatus.ts:14:10
     pending: 'bg-yellow-900 text-yellow-200',
     paused: 'bg-gray-900 text-gray-200',
   }
-  return statusMap[status] || 'bg-gray-900 text-gray-200'
+  return false
 }
 
killedBy: ExecutionStatusBadge should use dark variant by default
statusReason: expected 'px-3 py-1 rounded text-sm font-medium…' to contain 'bg-green-900'

[Killed] BlockStatement
src/utils/executionStatus.ts:20:73
 /**
  * Get Tailwind CSS classes for execution status badge (light theme variant)
  */
-export const getExecutionStatusColorLight = (status: string): string => {
-  const statusMap: Record<string, string> = {
-    completed: 'bg-green-100 text-green-800',
-    failed: 'bg-red-100 text-red-800',
-    running: 'bg-blue-100 text-blue-800',
-    pending: 'bg-yellow-100 text-yellow-800',
-    paused: 'bg-gray-100 text-gray-800',
-  }
-  return statusMap[status] || 'bg-gray-100 text-gray-800'
-}
+export const getExecutionStatusColorLight = (status: string): string => {}
 
 /**
killedBy: ExecutionStatusBadge should use light variant when specified
statusReason: expected 'px-3 py-1 rounded text-sm font-medium…' to contain 'bg-green-100'

[Killed] StringLiteral
src/utils/executionStatus.ts:23:13
 export const getExecutionStatusColorLight = (status: string): string => {
   const statusMap: Record<string, string> = {
     completed: 'bg-green-100 text-green-800',
-    failed: 'bg-red-100 text-red-800',
+    failed: "",
     running: 'bg-blue-100 text-blue-800',
     pending: 'bg-yellow-100 text-yellow-800',
killedBy: executionStatus utilities getExecutionStatusColorLight should return correct light color for failed status
statusReason: expected 'bg-gray-100 text-gray-800' to be 'bg-red-100 text-red-800' // Object.is equality

[Survived] StringLiteral
src/utils/executionStatus.ts:26:13
     failed: 'bg-red-100 text-red-800',
     running: 'bg-blue-100 text-blue-800',
     pending: 'bg-yellow-100 text-yellow-800',
-    paused: 'bg-gray-100 text-gray-800',
+    paused: "",
   }
   return statusMap[status] || 'bg-gray-100 text-gray-800'

[Killed] ConditionalExpression
src/utils/executionStatus.ts:28:10
     pending: 'bg-yellow-100 text-yellow-800',
     paused: 'bg-gray-100 text-gray-800',
   }
-  return statusMap[status] || 'bg-gray-100 text-gray-800'
+  return true
 }
 
killedBy: executionStatus utilities getExecutionStatusColorLight should return correct light color for completed status
statusReason: expected true to be 'bg-green-100 text-green-800' // Object.is equality

[Killed] LogicalOperator
src/utils/executionStatus.ts:28:10
     pending: 'bg-yellow-100 text-yellow-800',
     paused: 'bg-gray-100 text-gray-800',
   }
-  return statusMap[status] || 'bg-gray-100 text-gray-800'
+  return statusMap[status] && 'bg-gray-100 text-gray-800'
 }
 
killedBy: executionStatus utilities getExecutionStatusColorLight should return correct light color for completed status
statusReason: expected 'bg-gray-100 text-gray-800' to be 'bg-green-100 text-green-800' // Object.is equality

[Killed] BlockStatement
src/utils/executionStatus.ts:34:86
 /**
  * Type guard to check if a string is a valid execution status
  */
-export const isValidExecutionStatus = (status: string): status is ExecutionStatus => {
-  return ['pending', 'running', 'completed', 'failed', 'paused'].includes(status)
-}
+export const isValidExecutionStatus = (status: string): status is ExecutionStatus => {}
 
 
killedBy: executionStatus utilities isValidExecutionStatus should return true for valid statuses
statusReason: expected undefined to be true // Object.is equality

[Killed] StringLiteral
src/utils/executionStatus.ts:35:33
  * Type guard to check if a string is a valid execution status
  */
 export const isValidExecutionStatus = (status: string): status is ExecutionStatus => {
-  return ['pending', 'running', 'completed', 'failed', 'paused'].includes(status)
+  return ['pending', 'running', "", 'failed', 'paused'].includes(status)
 }
 
killedBy: ExecutionStatusBadge should render completed status
statusReason: Unable to find an element with the text: completed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="px-3 py-1 rounded text-sm font-medium bg-yellow-900 text-yellow-200 "
    >

[Killed] ArrayDeclaration
src/utils/executionStatus.ts:35:10
  * Type guard to check if a string is a valid execution status
  */
 export const isValidExecutionStatus = (status: string): status is ExecutionStatus => {
-  return ['pending', 'running', 'completed', 'failed', 'paused'].includes(status)
+  return [].includes(status)
 }
 
killedBy: executionStatus utilities isValidExecutionStatus should return true for valid statuses
statusReason: expected false to be true // Object.is equality
