[Killed] BlockStatement
src/utils/logLevel.ts:6:60
 /**
  * Get Tailwind CSS classes for log level badge
  */
-export const getLogLevelColor = (level: string): string => {
-  const levelMap: Record<string, string> = {
-    ERROR: 'bg-red-900/30 text-red-200',
-    WARNING: 'bg-yellow-900/30 text-yellow-200',
-    INFO: 'bg-gray-800 text-gray-300',
-    DEBUG: 'bg-blue-900/30 text-blue-200',
-  }
-  return levelMap[level] || 'bg-gray-800 text-gray-300'
-}
+export const getLogLevelColor = (level: string): string => {}
 
 /**
killedBy: LogLevelBadge should show background by default
statusReason: expected 'font-semibold undefined ' to contain 'bg-red-900/30'

[Killed] StringLiteral
src/utils/logLevel.ts:9:14
 export const getLogLevelColor = (level: string): string => {
   const levelMap: Record<string, string> = {
     ERROR: 'bg-red-900/30 text-red-200',
-    WARNING: 'bg-yellow-900/30 text-yellow-200',
+    WARNING: "",
     INFO: 'bg-gray-800 text-gray-300',
     DEBUG: 'bg-blue-900/30 text-blue-200',
killedBy: logLevel utilities getLogLevelColor should return correct color for WARNING level
statusReason: expected 'bg-gray-800 text-gray-300' to be 'bg-yellow-900/30 text-yellow-200' // Object.is equality

[Survived] StringLiteral
src/utils/logLevel.ts:10:11
   const levelMap: Record<string, string> = {
     ERROR: 'bg-red-900/30 text-red-200',
     WARNING: 'bg-yellow-900/30 text-yellow-200',
-    INFO: 'bg-gray-800 text-gray-300',
+    INFO: "",
     DEBUG: 'bg-blue-900/30 text-blue-200',
   }

[Killed] ConditionalExpression
src/utils/logLevel.ts:13:10
     INFO: 'bg-gray-800 text-gray-300',
     DEBUG: 'bg-blue-900/30 text-blue-200',
   }
-  return levelMap[level] || 'bg-gray-800 text-gray-300'
+  return false
 }
 
killedBy: LogLevelBadge should show background by default
statusReason: expected 'font-semibold false ' to contain 'bg-red-900/30'

[Killed] LogicalOperator
src/utils/logLevel.ts:13:10
     INFO: 'bg-gray-800 text-gray-300',
     DEBUG: 'bg-blue-900/30 text-blue-200',
   }
-  return levelMap[level] || 'bg-gray-800 text-gray-300'
+  return levelMap[level] && 'bg-gray-800 text-gray-300'
 }
 
killedBy: LogLevelBadge should show background by default
statusReason: expected 'font-semibold bg-gray-800 text-gray-3…' to contain 'bg-red-900/30'

[Killed] BlockStatement
src/utils/logLevel.ts:19:64
 /**
  * Get Tailwind CSS classes for log level text color
  */
-export const getLogLevelTextColor = (level: string): string => {
-  const levelMap: Record<string, string> = {
-    ERROR: 'text-red-400',
-    WARNING: 'text-yellow-400',
-    INFO: 'text-gray-300',
-    DEBUG: 'text-blue-400',
-  }
-  return levelMap[level] || 'text-gray-300'
-}
+export const getLogLevelTextColor = (level: string): string => {}
 
 /**
killedBy: LogLevelBadge should hide background when showBackground is false
statusReason: expected 'font-semibold undefined ' to contain 'text-red-400'

[Killed] StringLiteral
src/utils/logLevel.ts:24:12
     ERROR: 'text-red-400',
     WARNING: 'text-yellow-400',
     INFO: 'text-gray-300',
-    DEBUG: 'text-blue-400',
+    DEBUG: "",
   }
   return levelMap[level] || 'text-gray-300'
killedBy: logLevel utilities getLogLevelTextColor should return correct text color for DEBUG level
statusReason: expected 'text-gray-300' to be 'text-blue-400' // Object.is equality

[Killed] LogicalOperator
src/utils/logLevel.ts:26:10
     INFO: 'text-gray-300',
     DEBUG: 'text-blue-400',
   }
-  return levelMap[level] || 'text-gray-300'
+  return levelMap[level] && 'text-gray-300'
 }
 
killedBy: LogLevelBadge should hide background when showBackground is false
statusReason: expected 'font-semibold text-gray-300 ' to contain 'text-red-400'

[Killed] ConditionalExpression
src/utils/logLevel.ts:26:10
     INFO: 'text-gray-300',
     DEBUG: 'text-blue-400',
   }
-  return levelMap[level] || 'text-gray-300'
+  return true
 }
 
killedBy: LogLevelBadge should hide background when showBackground is false
statusReason: expected 'font-semibold true ' to contain 'text-red-400'

[Killed] BlockStatement
src/utils/logLevel.ts:32:70
 /**
  * Type guard to check if a string is a valid log level
  */
-export const isValidLogLevel = (level: string): level is LogLevel => {
-  return ['INFO', 'WARNING', 'ERROR', 'DEBUG'].includes(level)
-}
+export const isValidLogLevel = (level: string): level is LogLevel => {}
 
 
killedBy: logLevel utilities isValidLogLevel should return true for valid log levels
statusReason: expected undefined to be true // Object.is equality

[Killed] StringLiteral
src/utils/logLevel.ts:33:19
  * Type guard to check if a string is a valid log level
  */
 export const isValidLogLevel = (level: string): level is LogLevel => {
-  return ['INFO', 'WARNING', 'ERROR', 'DEBUG'].includes(level)
+  return ['INFO', "", 'ERROR', 'DEBUG'].includes(level)
 }
 
killedBy: LogLevelBadge should render WARNING level
statusReason: Unable to find an element with the text: WARNING. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      class="font-semibold bg-gray-800 text-gray-300 "
    >

[Killed] ArrayDeclaration
src/utils/logLevel.ts:33:10
  * Type guard to check if a string is a valid log level
  */
 export const isValidLogLevel = (level: string): level is LogLevel => {
-  return ['INFO', 'WARNING', 'ERROR', 'DEBUG'].includes(level)
+  return [].includes(level)
 }
 
killedBy: LogLevelBadge should render ERROR level
statusReason: Unable to find an element with the text: ERROR. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      class="font-semibold bg-gray-800 text-gray-300 "
    >
